garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
// Register: CM2PCH
#define CM2PCH CM2PCH
CM2PCH                                   equ 0077h
// bitfield definitions
CM2PCH_PCH_POSN                          equ 0000h
CM2PCH_PCH_POSITION                      equ 0000h
CM2PCH_PCH_SIZE                          equ 0003h
CM2PCH_PCH_LENGTH                        equ 0003h
CM2PCH_PCH_MASK                          equ 0007h
CM2PCH_PCH0_POSN                         equ 0000h
CM2PCH_PCH0_POSITION                     equ 0000h
CM2PCH_PCH0_SIZE                         equ 0001h
CM2PCH_PCH0_LENGTH                       equ 0001h
CM2PCH_PCH0_MASK                         equ 0001h
CM2PCH_PCH1_POSN                         equ 0001h
CM2PCH_PCH1_POSITION                     equ 0001h
CM2PCH_PCH1_SIZE                         equ 0001h
CM2PCH_PCH1_LENGTH                       equ 0001h
CM2PCH_PCH1_MASK                         equ 0002h
CM2PCH_PCH2_POSN                         equ 0002h
CM2PCH_PCH2_POSITION                     equ 0002h
CM2PCH_PCH2_SIZE                         equ 0001h
CM2PCH_PCH2_LENGTH                       equ 0001h
CM2PCH_PCH2_MASK                         equ 0004h
CM2PCH_C2PCH0_POSN                       equ 0000h
CM2PCH_C2PCH0_POSITION                   equ 0000h
CM2PCH_C2PCH0_SIZE                       equ 0001h
CM2PCH_C2PCH0_LENGTH                     equ 0001h
CM2PCH_C2PCH0_MASK                       equ 0001h
CM2PCH_C2PCH1_POSN                       equ 0001h
CM2PCH_C2PCH1_POSITION                   equ 0001h
CM2PCH_C2PCH1_SIZE                       equ 0001h
CM2PCH_C2PCH1_LENGTH                     equ 0001h
CM2PCH_C2PCH1_MASK                       equ 0002h
CM2PCH_C2PCH2_POSN                       equ 0002h
CM2PCH_C2PCH2_POSITION                   equ 0002h
CM2PCH_C2PCH2_SIZE                       equ 0001h
CM2PCH_C2PCH2_LENGTH                     equ 0001h
CM2PCH_C2PCH2_MASK                       equ 0004h

// Register: WDTCON0
#define WDTCON0 WDTCON0
WDTCON0                                  equ 0078h
// bitfield definitions
WDTCON0_SEN_POSN                         equ 0000h
WDTCON0_SEN_POSITION                     equ 0000h
WDTCON0_SEN_SIZE                         equ 0001h
WDTCON0_SEN_LENGTH                       equ 0001h
WDTCON0_SEN_MASK                         equ 0001h
WDTCON0_PS_POSN                          equ 0001h
WDTCON0_PS_POSITION                      equ 0001h
WDTCON0_PS_SIZE                          equ 0005h
WDTCON0_PS_LENGTH                        equ 0005h
WDTCON0_PS_MASK                          equ 003Eh
WDTCON0_SWDTEN_POSN                      equ 0000h
WDTCON0_SWDTEN_POSITION                  equ 0000h
WDTCON0_SWDTEN_SIZE                      equ 0001h
WDTCON0_SWDTEN_LENGTH                    equ 0001h
WDTCON0_SWDTEN_MASK                      equ 0001h
WDTCON0_WDTPS_POSN                       equ 0001h
WDTCON0_WDTPS_POSITION                   equ 0001h
WDTCON0_WDTPS_SIZE                       equ 0005h
WDTCON0_WDTPS_LENGTH                     equ 0005h
WDTCON0_WDTPS_MASK                       equ 003Eh
WDTCON0_WDTSEN_POSN                      equ 0000h
WDTCON0_WDTSEN_POSITION                  equ 0000h
WDTCON0_WDTSEN_SIZE                      equ 0001h
WDTCON0_WDTSEN_LENGTH                    equ 0001h
WDTCON0_WDTSEN_MASK                      equ 0001h
WDTCON0_PS0_POSN                         equ 0001h
WDTCON0_PS0_POSITION                     equ 0001h
WDTCON0_PS0_SIZE                         equ 0001h
WDTCON0_PS0_LENGTH                       equ 0001h
WDTCON0_PS0_MASK                         equ 0002h
WDTCON0_PS1_POSN                         equ 0002h
WDTCON0_PS1_POSITION                     equ 0002h
WDTCON0_PS1_SIZE                         equ 0001h
WDTCON0_PS1_LENGTH                       equ 0001h
WDTCON0_PS1_MASK                         equ 0004h
WDTCON0_PS2_POSN                         equ 0003h
WDTCON0_PS2_POSITION                     equ 0003h
WDTCON0_PS2_SIZE                         equ 0001h
WDTCON0_PS2_LENGTH                       equ 0001h
WDTCON0_PS2_MASK                         equ 0008h
WDTCON0_PS3_POSN                         equ 0004h
WDTCON0_PS3_POSITION                     equ 0004h
WDTCON0_PS3_SIZE                         equ 0001h
WDTCON0_PS3_LENGTH                       equ 0001h
WDTCON0_PS3_MASK                         equ 0010h
WDTCON0_PS4_POSN                         equ 0005h
WDTCON0_PS4_POSITION                     equ 0005h
WDTCON0_PS4_SIZE                         equ 0001h
WDTCON0_PS4_LENGTH                       equ 0001h
WDTCON0_PS4_MASK                         equ 0020h
WDTCON0_WDTPS0_POSN                      equ 0001h
WDTCON0_WDTPS0_POSITION                  equ 0001h
WDTCON0_WDTPS0_SIZE                      equ 0001h
WDTCON0_WDTPS0_LENGTH                    equ 0001h
WDTCON0_WDTPS0_MASK                      equ 0002h
WDTCON0_WDTPS1_POSN                      equ 0002h
WDTCON0_WDTPS1_POSITION                  equ 0002h
WDTCON0_WDTPS1_SIZE                      equ 0001h
WDTCON0_WDTPS1_LENGTH                    equ 0001h
WDTCON0_WDTPS1_MASK                      equ 0004h
WDTCON0_WDTPS2_POSN                      equ 0003h
WDTCON0_WDTPS2_POSITION                  equ 0003h
WDTCON0_WDTPS2_SIZE                      equ 0001h
WDTCON0_WDTPS2_LENGTH                    equ 0001h
WDTCON0_WDTPS2_MASK                      equ 0008h
WDTCON0_WDTPS3_POSN                      equ 0004h
WDTCON0_WDTPS3_POSITION                  equ 0004h
WDTCON0_WDTPS3_SIZE                      equ 0001h
WDTCON0_WDTPS3_LENGTH                    equ 0001h
WDTCON0_WDTPS3_MASK                      equ 0010h
WDTCON0_WDTPS4_POSN                      equ 0005h
WDTCON0_WDTPS4_POSITION                  equ 0005h
WDTCON0_WDTPS4_SIZE                      equ 0001h
WDTCON0_WDTPS4_LENGTH                    equ 0001h
WDTCON0_WDTPS4_MASK                      equ 0020h

// Register: WDTCON1
#define WDTCON1 WDTCON1
WDTCON1                                  equ 0079h
// bitfield definitions
WDTCON1_WINDOW_POSN                      equ 0000h
WDTCON1_WINDOW_POSITION                  equ 0000h
WDTCON1_WINDOW_SIZE                      equ 0003h
WDTCON1_WINDOW_LENGTH                    equ 0003h
WDTCON1_WINDOW_MASK                      equ 0007h
WDTCON1_CS_POSN                          equ 0004h
WDTCON1_CS_POSITION                      equ 0004h
WDTCON1_CS_SIZE                          equ 0003h
WDTCON1_CS_LENGTH                        equ 0003h
WDTCON1_CS_MASK                          equ 0070h
WDTCON1_WINDOW0_POSN                     equ 0000h
WDTCON1_WINDOW0_POSITION                 equ 0000h
WDTCON1_WINDOW0_SIZE                     equ 0001h
WDTCON1_WINDOW0_LENGTH                   equ 0001h
WDTCON1_WINDOW0_MASK                     equ 0001h
WDTCON1_WINDOW1_POSN                     equ 0001h
WDTCON1_WINDOW1_POSITION                 equ 0001h
WDTCON1_WINDOW1_SIZE                     equ 0001h
WDTCON1_WINDOW1_LENGTH                   equ 0001h
WDTCON1_WINDOW1_MASK                     equ 0002h
WDTCON1_WINDOW2_POSN                     equ 0002h
WDTCON1_WINDOW2_POSITION                 equ 0002h
WDTCON1_WINDOW2_SIZE                     equ 0001h
WDTCON1_WINDOW2_LENGTH                   equ 0001h
WDTCON1_WINDOW2_MASK                     equ 0004h
WDTCON1_WDTCS_POSN                       equ 0004h
WDTCON1_WDTCS_POSITION                   equ 0004h
WDTCON1_WDTCS_SIZE                       equ 0003h
WDTCON1_WDTCS_LENGTH                     equ 0003h
WDTCON1_WDTCS_MASK                       equ 0070h
WDTCON1_WDTWINDOW_POSN                   equ 0000h
WDTCON1_WDTWINDOW_POSITION               equ 0000h
WDTCON1_WDTWINDOW_SIZE                   equ 0003h
WDTCON1_WDTWINDOW_LENGTH                 equ 0003h
WDTCON1_WDTWINDOW_MASK                   equ 0007h
WDTCON1_CS0_POSN                         equ 0004h
WDTCON1_CS0_POSITION                     equ 0004h
WDTCON1_CS0_SIZE                         equ 0001h
WDTCON1_CS0_LENGTH                       equ 0001h
WDTCON1_CS0_MASK                         equ 0010h
WDTCON1_CS1_POSN                         equ 0005h
WDTCON1_CS1_POSITION                     equ 0005h
WDTCON1_CS1_SIZE                         equ 0001h
WDTCON1_CS1_LENGTH                       equ 0001h
WDTCON1_CS1_MASK                         equ 0020h
WDTCON1_CS2_POSN                         equ 0006h
WDTCON1_CS2_POSITION                     equ 0006h
WDTCON1_CS2_SIZE                         equ 0001h
WDTCON1_CS2_LENGTH                       equ 0001h
WDTCON1_CS2_MASK                         equ 0040h
WDTCON1_WDTWINDOW0_POSN                  equ 0000h
WDTCON1_WDTWINDOW0_POSITION              equ 0000h
WDTCON1_WDTWINDOW0_SIZE                  equ 0001h
WDTCON1_WDTWINDOW0_LENGTH                equ 0001h
WDTCON1_WDTWINDOW0_MASK                  equ 0001h
WDTCON1_WDTWINDOW1_POSN                  equ 0001h
WDTCON1_WDTWINDOW1_POSITION              equ 0001h
WDTCON1_WDTWINDOW1_SIZE                  equ 0001h
WDTCON1_WDTWINDOW1_LENGTH                equ 0001h
WDTCON1_WDTWINDOW1_MASK                  equ 0002h
WDTCON1_WDTWINDOW2_POSN                  equ 0002h
WDTCON1_WDTWINDOW2_POSITION              equ 0002h
WDTCON1_WDTWINDOW2_SIZE                  equ 0001h
WDTCON1_WDTWINDOW2_LENGTH                equ 0001h
WDTCON1_WDTWINDOW2_MASK                  equ 0004h
WDTCON1_WDTCS0_POSN                      equ 0004h
WDTCON1_WDTCS0_POSITION                  equ 0004h
WDTCON1_WDTCS0_SIZE                      equ 0001h
WDTCON1_WDTCS0_LENGTH                    equ 0001h
WDTCON1_WDTCS0_MASK                      equ 0010h
WDTCON1_WDTCS1_POSN                      equ 0005h
WDTCON1_WDTCS1_POSITION                  equ 0005h
WDTCON1_WDTCS1_SIZE                      equ 0001h
WDTCON1_WDTCS1_LENGTH                    equ 0001h
WDTCON1_WDTCS1_MASK                      equ 0020h
WDTCON1_WDTCS2_POSN                      equ 0006h
WDTCON1_WDTCS2_POSITION                  equ 0006h
WDTCON1_WDTCS2_SIZE                      equ 0001h
WDTCON1_WDTCS2_LENGTH                    equ 0001h
WDTCON1_WDTCS2_MASK                      equ 0040h

