garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
// Register: OPA2CON0
#define OPA2CON0 OPA2CON0
OPA2CON0                                 equ 0127h
// bitfield definitions
OPA2CON0_UG_POSN                         equ 0003h
OPA2CON0_UG_POSITION                     equ 0003h
OPA2CON0_UG_SIZE                         equ 0001h
OPA2CON0_UG_LENGTH                       equ 0001h
OPA2CON0_UG_MASK                         equ 0008h
OPA2CON0_CPON_POSN                       equ 0005h
OPA2CON0_CPON_POSITION                   equ 0005h
OPA2CON0_CPON_SIZE                       equ 0001h
OPA2CON0_CPON_LENGTH                     equ 0001h
OPA2CON0_CPON_MASK                       equ 0020h
OPA2CON0_EN_POSN                         equ 0007h
OPA2CON0_EN_POSITION                     equ 0007h
OPA2CON0_EN_SIZE                         equ 0001h
OPA2CON0_EN_LENGTH                       equ 0001h
OPA2CON0_EN_MASK                         equ 0080h
OPA2CON0_UG0_POSN                        equ 0003h
OPA2CON0_UG0_POSITION                    equ 0003h
OPA2CON0_UG0_SIZE                        equ 0001h
OPA2CON0_UG0_LENGTH                      equ 0001h
OPA2CON0_UG0_MASK                        equ 0008h
OPA2CON0_OPA2UG_POSN                     equ 0003h
OPA2CON0_OPA2UG_POSITION                 equ 0003h
OPA2CON0_OPA2UG_SIZE                     equ 0001h
OPA2CON0_OPA2UG_LENGTH                   equ 0001h
OPA2CON0_OPA2UG_MASK                     equ 0008h
OPA2CON0_OPA2CPON_POSN                   equ 0005h
OPA2CON0_OPA2CPON_POSITION               equ 0005h
OPA2CON0_OPA2CPON_SIZE                   equ 0001h
OPA2CON0_OPA2CPON_LENGTH                 equ 0001h
OPA2CON0_OPA2CPON_MASK                   equ 0020h
OPA2CON0_OPA2EN_POSN                     equ 0007h
OPA2CON0_OPA2EN_POSITION                 equ 0007h
OPA2CON0_OPA2EN_SIZE                     equ 0001h
OPA2CON0_OPA2EN_LENGTH                   equ 0001h
OPA2CON0_OPA2EN_MASK                     equ 0080h

// Register: OPA2CON1
#define OPA2CON1 OPA2CON1
OPA2CON1                                 equ 0128h
// bitfield definitions
OPA2CON1_NSS_POSN                        equ 0000h
OPA2CON1_NSS_POSITION                    equ 0000h
OPA2CON1_NSS_SIZE                        equ 0003h
OPA2CON1_NSS_LENGTH                      equ 0003h
OPA2CON1_NSS_MASK                        equ 0007h
OPA2CON1_RESON_POSN                      equ 0003h
OPA2CON1_RESON_POSITION                  equ 0003h
OPA2CON1_RESON_SIZE                      equ 0001h
OPA2CON1_RESON_LENGTH                    equ 0001h
OPA2CON1_RESON_MASK                      equ 0008h
OPA2CON1_GSEL_POSN                       equ 0004h
OPA2CON1_GSEL_POSITION                   equ 0004h
OPA2CON1_GSEL_SIZE                       equ 0003h
OPA2CON1_GSEL_LENGTH                     equ 0003h
OPA2CON1_GSEL_MASK                       equ 0070h
OPA2CON1_NSS0_POSN                       equ 0000h
OPA2CON1_NSS0_POSITION                   equ 0000h
OPA2CON1_NSS0_SIZE                       equ 0001h
OPA2CON1_NSS0_LENGTH                     equ 0001h
OPA2CON1_NSS0_MASK                       equ 0001h
OPA2CON1_NSS1_POSN                       equ 0001h
OPA2CON1_NSS1_POSITION                   equ 0001h
OPA2CON1_NSS1_SIZE                       equ 0001h
OPA2CON1_NSS1_LENGTH                     equ 0001h
OPA2CON1_NSS1_MASK                       equ 0002h
OPA2CON1_NSS2_POSN                       equ 0002h
OPA2CON1_NSS2_POSITION                   equ 0002h
OPA2CON1_NSS2_SIZE                       equ 0001h
OPA2CON1_NSS2_LENGTH                     equ 0001h
OPA2CON1_NSS2_MASK                       equ 0004h
OPA2CON1_GSEL0_POSN                      equ 0004h
OPA2CON1_GSEL0_POSITION                  equ 0004h
OPA2CON1_GSEL0_SIZE                      equ 0001h
OPA2CON1_GSEL0_LENGTH                    equ 0001h
OPA2CON1_GSEL0_MASK                      equ 0010h
OPA2CON1_GSEL1_POSN                      equ 0005h
OPA2CON1_GSEL1_POSITION                  equ 0005h
OPA2CON1_GSEL1_SIZE                      equ 0001h
OPA2CON1_GSEL1_LENGTH                    equ 0001h
OPA2CON1_GSEL1_MASK                      equ 0020h
OPA2CON1_GSEL2_POSN                      equ 0006h
OPA2CON1_GSEL2_POSITION                  equ 0006h
OPA2CON1_GSEL2_SIZE                      equ 0001h
OPA2CON1_GSEL2_LENGTH                    equ 0001h
OPA2CON1_GSEL2_MASK                      equ 0040h
OPA2CON1_OPA2NSS_POSN                    equ 0000h
OPA2CON1_OPA2NSS_POSITION                equ 0000h
OPA2CON1_OPA2NSS_SIZE                    equ 0003h
OPA2CON1_OPA2NSS_LENGTH                  equ 0003h
OPA2CON1_OPA2NSS_MASK                    equ 0007h
OPA2CON1_OPA2RESON_POSN                  equ 0003h
OPA2CON1_OPA2RESON_POSITION              equ 0003h
OPA2CON1_OPA2RESON_SIZE                  equ 0001h
OPA2CON1_OPA2RESON_LENGTH                equ 0001h
OPA2CON1_OPA2RESON_MASK                  equ 0008h
OPA2CON1_OPA2GSEL_POSN                   equ 0004h
OPA2CON1_OPA2GSEL_POSITION               equ 0004h
OPA2CON1_OPA2GSEL_SIZE                   equ 0003h
OPA2CON1_OPA2GSEL_LENGTH                 equ 0003h
OPA2CON1_OPA2GSEL_MASK                   equ 0070h
OPA2CON1_OPA2NSS0_POSN                   equ 0000h
OPA2CON1_OPA2NSS0_POSITION               equ 0000h
OPA2CON1_OPA2NSS0_SIZE                   equ 0001h
OPA2CON1_OPA2NSS0_LENGTH                 equ 0001h
OPA2CON1_OPA2NSS0_MASK                   equ 0001h
OPA2CON1_OPA2NSS1_POSN                   equ 0001h
OPA2CON1_OPA2NSS1_POSITION               equ 0001h
OPA2CON1_OPA2NSS1_SIZE                   equ 0001h
OPA2CON1_OPA2NSS1_LENGTH                 equ 0001h
OPA2CON1_OPA2NSS1_MASK                   equ 0002h
OPA2CON1_OPA2NSS2_POSN                   equ 0002h
OPA2CON1_OPA2NSS2_POSITION               equ 0002h
OPA2CON1_OPA2NSS2_SIZE                   equ 0001h
OPA2CON1_OPA2NSS2_LENGTH                 equ 0001h
OPA2CON1_OPA2NSS2_MASK                   equ 0004h
OPA2CON1_OPA2GSEL0_POSN                  equ 0004h
OPA2CON1_OPA2GSEL0_POSITION              equ 0004h
OPA2CON1_OPA2GSEL0_SIZE                  equ 0001h
OPA2CON1_OPA2GSEL0_LENGTH                equ 0001h
OPA2CON1_OPA2GSEL0_MASK                  equ 0010h
OPA2CON1_OPA2GSEL1_POSN                  equ 0005h
OPA2CON1_OPA2GSEL1_POSITION              equ 0005h
OPA2CON1_OPA2GSEL1_SIZE                  equ 0001h
OPA2CON1_OPA2GSEL1_LENGTH                equ 0001h
OPA2CON1_OPA2GSEL1_MASK                  equ 0020h
OPA2CON1_OPA2GSEL2_POSN                  equ 0006h
OPA2CON1_OPA2GSEL2_POSITION              equ 0006h
OPA2CON1_OPA2GSEL2_SIZE                  equ 0001h
OPA2CON1_OPA2GSEL2_LENGTH                equ 0001h
OPA2CON1_OPA2GSEL2_MASK                  equ 0040h

