garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
// Register: PCLATU_SHAD
#define PCLATU_SHAD PCLATU_SHAD
PCLATU_SHAD                              equ 037Bh
// bitfield definitions
PCLATU_SHAD_PCU_POSN                     equ 0000h
PCLATU_SHAD_PCU_POSITION                 equ 0000h
PCLATU_SHAD_PCU_SIZE                     equ 0005h
PCLATU_SHAD_PCU_LENGTH                   equ 0005h
PCLATU_SHAD_PCU_MASK                     equ 001Fh

// Register: FSR0SH
#define FSR0SH FSR0SH
FSR0SH                                   equ 037Ch

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 037Ch
// bitfield definitions
FSR0L_SHAD_FSR0L_POSN                    equ 0000h
FSR0L_SHAD_FSR0L_POSITION                equ 0000h
FSR0L_SHAD_FSR0L_SIZE                    equ 0008h
FSR0L_SHAD_FSR0L_LENGTH                  equ 0008h
FSR0L_SHAD_FSR0L_MASK                    equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 037Dh
// bitfield definitions
FSR0H_SHAD_FSR0H_POSN                    equ 0000h
FSR0H_SHAD_FSR0H_POSITION                equ 0000h
FSR0H_SHAD_FSR0H_SIZE                    equ 0006h
FSR0H_SHAD_FSR0H_LENGTH                  equ 0006h
FSR0H_SHAD_FSR0H_MASK                    equ 003Fh

// Register: FSR1SH
#define FSR1SH FSR1SH
FSR1SH                                   equ 037Eh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 037Eh
// bitfield definitions
FSR1L_SHAD_FSR1L_POSN                    equ 0000h
FSR1L_SHAD_FSR1L_POSITION                equ 0000h
FSR1L_SHAD_FSR1L_SIZE                    equ 0008h
FSR1L_SHAD_FSR1L_LENGTH                  equ 0008h
FSR1L_SHAD_FSR1L_MASK                    equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 037Fh
// bitfield definitions
FSR1H_SHAD_FSR1H_POSN                    equ 0000h
FSR1H_SHAD_FSR1H_POSITION                equ 0000h
FSR1H_SHAD_FSR1H_SIZE                    equ 0006h
FSR1H_SHAD_FSR1H_LENGTH                  equ 0006h
FSR1H_SHAD_FSR1H_MASK                    equ 003Fh

// Register: FSR2SH
#define FSR2SH FSR2SH
FSR2SH                                   equ 0380h

// Register: FSR2L_SHAD
#define FSR2L_SHAD FSR2L_SHAD
FSR2L_SHAD                               equ 0380h
// bitfield definitions
FSR2L_SHAD_FSR2L_POSN                    equ 0000h
FSR2L_SHAD_FSR2L_POSITION                equ 0000h
FSR2L_SHAD_FSR2L_SIZE                    equ 0008h
FSR2L_SHAD_FSR2L_LENGTH                  equ 0008h
FSR2L_SHAD_FSR2L_MASK                    equ 00FFh

// Register: FSR2H_SHAD
#define FSR2H_SHAD FSR2H_SHAD
FSR2H_SHAD                               equ 0381h
// bitfield definitions
FSR2H_SHAD_FSR2H_POSN                    equ 0000h
FSR2H_SHAD_FSR2H_POSITION                equ 0000h
FSR2H_SHAD_FSR2H_SIZE                    equ 0006h
FSR2H_SHAD_FSR2H_LENGTH                  equ 0006h
FSR2H_SHAD_FSR2H_MASK                    equ 003Fh

// Register: PRODSH
#define PRODSH PRODSH
PRODSH                                   equ 0382h

// Register: PRODL_SHAD
#define PRODL_SHAD PRODL_SHAD
PRODL_SHAD                               equ 0382h
// bitfield definitions
PRODL_SHAD_PRODL_POSN                    equ 0000h
PRODL_SHAD_PRODL_POSITION                equ 0000h
PRODL_SHAD_PRODL_SIZE                    equ 0008h
PRODL_SHAD_PRODL_LENGTH                  equ 0008h
PRODL_SHAD_PRODL_MASK                    equ 00FFh

// Register: PRODH_SHAD
#define PRODH_SHAD PRODH_SHAD
PRODH_SHAD                               equ 0383h
// bitfield definitions
PRODH_SHAD_PRODH_POSN                    equ 0000h
PRODH_SHAD_PRODH_POSITION                equ 0000h
PRODH_SHAD_PRODH_SIZE                    equ 0008h
PRODH_SHAD_PRODH_LENGTH                  equ 0008h
PRODH_SHAD_PRODH_MASK                    equ 00FFh

// Register: TU16ACON0
#define TU16ACON0 TU16ACON0
TU16ACON0                                equ 03A0h
// bitfield definitions
TU16ACON0_CIE_POSN                       equ 0000h
TU16ACON0_CIE_POSITION                   equ 0000h
TU16ACON0_CIE_SIZE                       equ 0001h
TU16ACON0_CIE_LENGTH                     equ 0001h
TU16ACON0_CIE_MASK                       equ 0001h
TU16ACON0_ZIE_POSN                       equ 0001h
TU16ACON0_ZIE_POSITION                   equ 0001h
TU16ACON0_ZIE_SIZE                       equ 0001h
TU16ACON0_ZIE_LENGTH                     equ 0001h
TU16ACON0_ZIE_MASK                       equ 0002h
TU16ACON0_PRIE_POSN                      equ 0002h
TU16ACON0_PRIE_POSITION                  equ 0002h
TU16ACON0_PRIE_SIZE                      equ 0001h
TU16ACON0_PRIE_LENGTH                    equ 0001h
TU16ACON0_PRIE_MASK                      equ 0004h
TU16ACON0_RDSEL_POSN                     equ 0003h
TU16ACON0_RDSEL_POSITION                 equ 0003h
TU16ACON0_RDSEL_SIZE                     equ 0001h
TU16ACON0_RDSEL_LENGTH                   equ 0001h
TU16ACON0_RDSEL_MASK                     equ 0008h
TU16ACON0_OPOL_POSN                      equ 0004h
TU16ACON0_OPOL_POSITION                  equ 0004h
TU16ACON0_OPOL_SIZE                      equ 0001h
TU16ACON0_OPOL_LENGTH                    equ 0001h
TU16ACON0_OPOL_MASK                      equ 0010h
TU16ACON0_OM_POSN                        equ 0005h
TU16ACON0_OM_POSITION                    equ 0005h
TU16ACON0_OM_SIZE                        equ 0001h
TU16ACON0_OM_LENGTH                      equ 0001h
TU16ACON0_OM_MASK                        equ 0020h
TU16ACON0_CPOL_POSN                      equ 0006h
TU16ACON0_CPOL_POSITION                  equ 0006h
TU16ACON0_CPOL_SIZE                      equ 0001h
TU16ACON0_CPOL_LENGTH                    equ 0001h
TU16ACON0_CPOL_MASK                      equ 0040h
TU16ACON0_ON_POSN                        equ 0007h
TU16ACON0_ON_POSITION                    equ 0007h
TU16ACON0_ON_SIZE                        equ 0001h
TU16ACON0_ON_LENGTH                      equ 0001h
TU16ACON0_ON_MASK                        equ 0080h
TU16ACON0_TU16ACIE_POSN                  equ 0000h
TU16ACON0_TU16ACIE_POSITION              equ 0000h
TU16ACON0_TU16ACIE_SIZE                  equ 0001h
TU16ACON0_TU16ACIE_LENGTH                equ 0001h
TU16ACON0_TU16ACIE_MASK                  equ 0001h
TU16ACON0_TU16AZIE_POSN                  equ 0001h
TU16ACON0_TU16AZIE_POSITION              equ 0001h
TU16ACON0_TU16AZIE_SIZE                  equ 0001h
TU16ACON0_TU16AZIE_LENGTH                equ 0001h
TU16ACON0_TU16AZIE_MASK                  equ 0002h
TU16ACON0_TU16APRIE_POSN                 equ 0002h
TU16ACON0_TU16APRIE_POSITION             equ 0002h
TU16ACON0_TU16APRIE_SIZE                 equ 0001h
TU16ACON0_TU16APRIE_LENGTH               equ 0001h
TU16ACON0_TU16APRIE_MASK                 equ 0004h
TU16ACON0_TU16ARDSEL_POSN                equ 0003h
TU16ACON0_TU16ARDSEL_POSITION            equ 0003h
TU16ACON0_TU16ARDSEL_SIZE                equ 0001h
TU16ACON0_TU16ARDSEL_LENGTH              equ 0001h
TU16ACON0_TU16ARDSEL_MASK                equ 0008h
TU16ACON0_TU16AOPOL_POSN                 equ 0004h
TU16ACON0_TU16AOPOL_POSITION             equ 0004h
TU16ACON0_TU16AOPOL_SIZE                 equ 0001h
TU16ACON0_TU16AOPOL_LENGTH               equ 0001h
TU16ACON0_TU16AOPOL_MASK                 equ 0010h
TU16ACON0_TU16AOM_POSN                   equ 0005h
TU16ACON0_TU16AOM_POSITION               equ 0005h
TU16ACON0_TU16AOM_SIZE                   equ 0001h
TU16ACON0_TU16AOM_LENGTH                 equ 0001h
TU16ACON0_TU16AOM_MASK                   equ 0020h
TU16ACON0_TU16ACPOL_POSN                 equ 0006h
TU16ACON0_TU16ACPOL_POSITION             equ 0006h
TU16ACON0_TU16ACPOL_SIZE                 equ 0001h
TU16ACON0_TU16ACPOL_LENGTH               equ 0001h
TU16ACON0_TU16ACPOL_MASK                 equ 0040h
TU16ACON0_TU16AON_POSN                   equ 0007h
TU16ACON0_TU16AON_POSITION               equ 0007h
TU16ACON0_TU16AON_SIZE                   equ 0001h
TU16ACON0_TU16AON_LENGTH                 equ 0001h
TU16ACON0_TU16AON_MASK                   equ 0080h

// Register: TU16ACON1
#define TU16ACON1 TU16ACON1
TU16ACON1                                equ 03A1h
// bitfield definitions
TU16ACON1_CIF_POSN                       equ 0000h
TU16ACON1_CIF_POSITION                   equ 0000h
TU16ACON1_CIF_SIZE                       equ 0001h
TU16ACON1_CIF_LENGTH                     equ 0001h
TU16ACON1_CIF_MASK                       equ 0001h
TU16ACON1_ZIF_POSN                       equ 0001h
TU16ACON1_ZIF_POSITION                   equ 0001h
TU16ACON1_ZIF_SIZE                       equ 0001h
TU16ACON1_ZIF_LENGTH                     equ 0001h
TU16ACON1_ZIF_MASK                       equ 0002h
TU16ACON1_PRIF_POSN                      equ 0002h
TU16ACON1_PRIF_POSITION                  equ 0002h
TU16ACON1_PRIF_SIZE                      equ 0001h
TU16ACON1_PRIF_LENGTH                    equ 0001h
TU16ACON1_PRIF_MASK                      equ 0004h
TU16ACON1_CAPT_POSN                      equ 0003h
TU16ACON1_CAPT_POSITION                  equ 0003h
TU16ACON1_CAPT_SIZE                      equ 0001h
TU16ACON1_CAPT_LENGTH                    equ 0001h
TU16ACON1_CAPT_MASK                      equ 0008h
TU16ACON1_LIMIT_POSN                     equ 0004h
TU16ACON1_LIMIT_POSITION                 equ 0004h
TU16ACON1_LIMIT_SIZE                     equ 0001h
TU16ACON1_LIMIT_LENGTH                   equ 0001h
TU16ACON1_LIMIT_MASK                     equ 0010h
TU16ACON1_CLR_POSN                       equ 0005h
TU16ACON1_CLR_POSITION                   equ 0005h
TU16ACON1_CLR_SIZE                       equ 0001h
TU16ACON1_CLR_LENGTH                     equ 0001h
TU16ACON1_CLR_MASK                       equ 0020h
TU16ACON1_OSEN_POSN                      equ 0006h
TU16ACON1_OSEN_POSITION                  equ 0006h
TU16ACON1_OSEN_SIZE                      equ 0001h
TU16ACON1_OSEN_LENGTH                    equ 0001h
TU16ACON1_OSEN_MASK                      equ 0040h
TU16ACON1_RUN_POSN                       equ 0007h
TU16ACON1_RUN_POSITION                   equ 0007h
TU16ACON1_RUN_SIZE                       equ 0001h
TU16ACON1_RUN_LENGTH                     equ 0001h
TU16ACON1_RUN_MASK                       equ 0080h
TU16ACON1_TU16ACIF_POSN                  equ 0000h
TU16ACON1_TU16ACIF_POSITION              equ 0000h
TU16ACON1_TU16ACIF_SIZE                  equ 0001h
TU16ACON1_TU16ACIF_LENGTH                equ 0001h
TU16ACON1_TU16ACIF_MASK                  equ 0001h
TU16ACON1_TU16AZIF_POSN                  equ 0001h
TU16ACON1_TU16AZIF_POSITION              equ 0001h
TU16ACON1_TU16AZIF_SIZE                  equ 0001h
TU16ACON1_TU16AZIF_LENGTH                equ 0001h
TU16ACON1_TU16AZIF_MASK                  equ 0002h
TU16ACON1_TU16APRIF_POSN                 equ 0002h
TU16ACON1_TU16APRIF_POSITION             equ 0002h
TU16ACON1_TU16APRIF_SIZE                 equ 0001h
TU16ACON1_TU16APRIF_LENGTH               equ 0001h
TU16ACON1_TU16APRIF_MASK                 equ 0004h
TU16ACON1_TU16ACAPT_POSN                 equ 0003h
TU16ACON1_TU16ACAPT_POSITION             equ 0003h
TU16ACON1_TU16ACAPT_SIZE                 equ 0001h
TU16ACON1_TU16ACAPT_LENGTH               equ 0001h
TU16ACON1_TU16ACAPT_MASK                 equ 0008h
TU16ACON1_TU16ALIMIT_POSN                equ 0004h
TU16ACON1_TU16ALIMIT_POSITION            equ 0004h
TU16ACON1_TU16ALIMIT_SIZE                equ 0001h
TU16ACON1_TU16ALIMIT_LENGTH              equ 0001h
TU16ACON1_TU16ALIMIT_MASK                equ 0010h
TU16ACON1_TU16ACLR_POSN                  equ 0005h
TU16ACON1_TU16ACLR_POSITION              equ 0005h
TU16ACON1_TU16ACLR_SIZE                  equ 0001h
TU16ACON1_TU16ACLR_LENGTH                equ 0001h
TU16ACON1_TU16ACLR_MASK                  equ 0020h
TU16ACON1_TMRAOSEN_POSN                  equ 0006h
TU16ACON1_TMRAOSEN_POSITION              equ 0006h
TU16ACON1_TMRAOSEN_SIZE                  equ 0001h
TU16ACON1_TMRAOSEN_LENGTH                equ 0001h
TU16ACON1_TMRAOSEN_MASK                  equ 0040h
TU16ACON1_TU16ARUN_POSN                  equ 0007h
TU16ACON1_TU16ARUN_POSITION              equ 0007h
TU16ACON1_TU16ARUN_SIZE                  equ 0001h
TU16ACON1_TU16ARUN_LENGTH                equ 0001h
TU16ACON1_TU16ARUN_MASK                  equ 0080h

// Register: TU16AHLT
#define TU16AHLT TU16AHLT
TU16AHLT                                 equ 03A2h
// bitfield definitions
TU16AHLT_STOP_POSN                       equ 0000h
TU16AHLT_STOP_POSITION                   equ 0000h
TU16AHLT_STOP_SIZE                       equ 0002h
TU16AHLT_STOP_LENGTH                     equ 0002h
TU16AHLT_STOP_MASK                       equ 0003h
TU16AHLT_RESET_POSN                      equ 0002h
TU16AHLT_RESET_POSITION                  equ 0002h
TU16AHLT_RESET_SIZE                      equ 0002h
TU16AHLT_RESET_LENGTH                    equ 0002h
TU16AHLT_RESET_MASK                      equ 000Ch
TU16AHLT_START_POSN                      equ 0004h
TU16AHLT_START_POSITION                  equ 0004h
TU16AHLT_START_SIZE                      equ 0002h
TU16AHLT_START_LENGTH                    equ 0002h
TU16AHLT_START_MASK                      equ 0030h
TU16AHLT_CSYNC_POSN                      equ 0006h
TU16AHLT_CSYNC_POSITION                  equ 0006h
TU16AHLT_CSYNC_SIZE                      equ 0001h
TU16AHLT_CSYNC_LENGTH                    equ 0001h
TU16AHLT_CSYNC_MASK                      equ 0040h
TU16AHLT_EPOL_POSN                       equ 0007h
TU16AHLT_EPOL_POSITION                   equ 0007h
TU16AHLT_EPOL_SIZE                       equ 0001h
TU16AHLT_EPOL_LENGTH                     equ 0001h
TU16AHLT_EPOL_MASK                       equ 0080h
TU16AHLT_STOP0_POSN                      equ 0000h
TU16AHLT_STOP0_POSITION                  equ 0000h
TU16AHLT_STOP0_SIZE                      equ 0001h
TU16AHLT_STOP0_LENGTH                    equ 0001h
TU16AHLT_STOP0_MASK                      equ 0001h
TU16AHLT_STOP1_POSN                      equ 0001h
TU16AHLT_STOP1_POSITION                  equ 0001h
TU16AHLT_STOP1_SIZE                      equ 0001h
TU16AHLT_STOP1_LENGTH                    equ 0001h
TU16AHLT_STOP1_MASK                      equ 0002h
TU16AHLT_RESET0_POSN                     equ 0002h
TU16AHLT_RESET0_POSITION                 equ 0002h
TU16AHLT_RESET0_SIZE                     equ 0001h
TU16AHLT_RESET0_LENGTH                   equ 0001h
TU16AHLT_RESET0_MASK                     equ 0004h
TU16AHLT_RESET1_POSN                     equ 0003h
TU16AHLT_RESET1_POSITION                 equ 0003h
TU16AHLT_RESET1_SIZE                     equ 0001h
TU16AHLT_RESET1_LENGTH                   equ 0001h
TU16AHLT_RESET1_MASK                     equ 0008h
TU16AHLT_START0_POSN                     equ 0004h
TU16AHLT_START0_POSITION                 equ 0004h
TU16AHLT_START0_SIZE                     equ 0001h
TU16AHLT_START0_LENGTH                   equ 0001h
TU16AHLT_START0_MASK                     equ 0010h
TU16AHLT_START1_POSN                     equ 0005h
TU16AHLT_START1_POSITION                 equ 0005h
TU16AHLT_START1_SIZE                     equ 0001h
TU16AHLT_START1_LENGTH                   equ 0001h
TU16AHLT_START1_MASK                     equ 0020h
TU16AHLT_TU16ASTOP_POSN                  equ 0000h
TU16AHLT_TU16ASTOP_POSITION              equ 0000h
TU16AHLT_TU16ASTOP_SIZE                  equ 0002h
TU16AHLT_TU16ASTOP_LENGTH                equ 0002h
TU16AHLT_TU16ASTOP_MASK                  equ 0003h
TU16AHLT_TU16ARESET_POSN                 equ 0002h
TU16AHLT_TU16ARESET_POSITION             equ 0002h
TU16AHLT_TU16ARESET_SIZE                 equ 0002h
TU16AHLT_TU16ARESET_LENGTH               equ 0002h
TU16AHLT_TU16ARESET_MASK                 equ 000Ch
TU16AHLT_TU16ASTART_POSN                 equ 0004h
TU16AHLT_TU16ASTART_POSITION             equ 0004h
TU16AHLT_TU16ASTART_SIZE                 equ 0002h
TU16AHLT_TU16ASTART_LENGTH               equ 0002h
TU16AHLT_TU16ASTART_MASK                 equ 0030h
TU16AHLT_TU16ACSYNC_POSN                 equ 0006h
TU16AHLT_TU16ACSYNC_POSITION             equ 0006h
TU16AHLT_TU16ACSYNC_SIZE                 equ 0001h
TU16AHLT_TU16ACSYNC_LENGTH               equ 0001h
TU16AHLT_TU16ACSYNC_MASK                 equ 0040h
TU16AHLT_TU16AEPOL_POSN                  equ 0007h
TU16AHLT_TU16AEPOL_POSITION              equ 0007h
TU16AHLT_TU16AEPOL_SIZE                  equ 0001h
TU16AHLT_TU16AEPOL_LENGTH                equ 0001h
TU16AHLT_TU16AEPOL_MASK                  equ 0080h
TU16AHLT_TU16ASTOP0_POSN                 equ 0000h
TU16AHLT_TU16ASTOP0_POSITION             equ 0000h
TU16AHLT_TU16ASTOP0_SIZE                 equ 0001h
TU16AHLT_TU16ASTOP0_LENGTH               equ 0001h
TU16AHLT_TU16ASTOP0_MASK                 equ 0001h
TU16AHLT_TU16ASTOP1_POSN                 equ 0001h
TU16AHLT_TU16ASTOP1_POSITION             equ 0001h
TU16AHLT_TU16ASTOP1_SIZE                 equ 0001h
TU16AHLT_TU16ASTOP1_LENGTH               equ 0001h
TU16AHLT_TU16ASTOP1_MASK                 equ 0002h
TU16AHLT_TU16ARESET0_POSN                equ 0002h
TU16AHLT_TU16ARESET0_POSITION            equ 0002h
TU16AHLT_TU16ARESET0_SIZE                equ 0001h
TU16AHLT_TU16ARESET0_LENGTH              equ 0001h
TU16AHLT_TU16ARESET0_MASK                equ 0004h
TU16AHLT_TU16ARESET1_POSN                equ 0003h
TU16AHLT_TU16ARESET1_POSITION            equ 0003h
TU16AHLT_TU16ARESET1_SIZE                equ 0001h
TU16AHLT_TU16ARESET1_LENGTH              equ 0001h
TU16AHLT_TU16ARESET1_MASK                equ 0008h
TU16AHLT_TU16ASTART0_POSN                equ 0004h
TU16AHLT_TU16ASTART0_POSITION            equ 0004h
TU16AHLT_TU16ASTART0_SIZE                equ 0001h
TU16AHLT_TU16ASTART0_LENGTH              equ 0001h
TU16AHLT_TU16ASTART0_MASK                equ 0010h
TU16AHLT_TU16ASTART1_POSN                equ 0005h
TU16AHLT_TU16ASTART1_POSITION            equ 0005h
TU16AHLT_TU16ASTART1_SIZE                equ 0001h
TU16AHLT_TU16ASTART1_LENGTH              equ 0001h
TU16AHLT_TU16ASTART1_MASK                equ 0020h

