garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
// Register: TU16BPRL
#define TU16BPRL TU16BPRL
TU16BPRL                                 equ 03B0h
// bitfield definitions
TU16BPRL_PRL_POSN                        equ 0000h
TU16BPRL_PRL_POSITION                    equ 0000h
TU16BPRL_PRL_SIZE                        equ 0008h
TU16BPRL_PRL_LENGTH                      equ 0008h
TU16BPRL_PRL_MASK                        equ 00FFh
TU16BPRL_PRL0_POSN                       equ 0000h
TU16BPRL_PRL0_POSITION                   equ 0000h
TU16BPRL_PRL0_SIZE                       equ 0001h
TU16BPRL_PRL0_LENGTH                     equ 0001h
TU16BPRL_PRL0_MASK                       equ 0001h
TU16BPRL_PRL1_POSN                       equ 0001h
TU16BPRL_PRL1_POSITION                   equ 0001h
TU16BPRL_PRL1_SIZE                       equ 0001h
TU16BPRL_PRL1_LENGTH                     equ 0001h
TU16BPRL_PRL1_MASK                       equ 0002h
TU16BPRL_PRL2_POSN                       equ 0002h
TU16BPRL_PRL2_POSITION                   equ 0002h
TU16BPRL_PRL2_SIZE                       equ 0001h
TU16BPRL_PRL2_LENGTH                     equ 0001h
TU16BPRL_PRL2_MASK                       equ 0004h
TU16BPRL_PRL3_POSN                       equ 0003h
TU16BPRL_PRL3_POSITION                   equ 0003h
TU16BPRL_PRL3_SIZE                       equ 0001h
TU16BPRL_PRL3_LENGTH                     equ 0001h
TU16BPRL_PRL3_MASK                       equ 0008h
TU16BPRL_PRL4_POSN                       equ 0004h
TU16BPRL_PRL4_POSITION                   equ 0004h
TU16BPRL_PRL4_SIZE                       equ 0001h
TU16BPRL_PRL4_LENGTH                     equ 0001h
TU16BPRL_PRL4_MASK                       equ 0010h
TU16BPRL_PRL5_POSN                       equ 0005h
TU16BPRL_PRL5_POSITION                   equ 0005h
TU16BPRL_PRL5_SIZE                       equ 0001h
TU16BPRL_PRL5_LENGTH                     equ 0001h
TU16BPRL_PRL5_MASK                       equ 0020h
TU16BPRL_PRL6_POSN                       equ 0006h
TU16BPRL_PRL6_POSITION                   equ 0006h
TU16BPRL_PRL6_SIZE                       equ 0001h
TU16BPRL_PRL6_LENGTH                     equ 0001h
TU16BPRL_PRL6_MASK                       equ 0040h
TU16BPRL_PRL7_POSN                       equ 0007h
TU16BPRL_PRL7_POSITION                   equ 0007h
TU16BPRL_PRL7_SIZE                       equ 0001h
TU16BPRL_PRL7_LENGTH                     equ 0001h
TU16BPRL_PRL7_MASK                       equ 0080h
TU16BPRL_TU16BPRL0_POSN                  equ 0000h
TU16BPRL_TU16BPRL0_POSITION              equ 0000h
TU16BPRL_TU16BPRL0_SIZE                  equ 0001h
TU16BPRL_TU16BPRL0_LENGTH                equ 0001h
TU16BPRL_TU16BPRL0_MASK                  equ 0001h
TU16BPRL_TU16BPRL1_POSN                  equ 0001h
TU16BPRL_TU16BPRL1_POSITION              equ 0001h
TU16BPRL_TU16BPRL1_SIZE                  equ 0001h
TU16BPRL_TU16BPRL1_LENGTH                equ 0001h
TU16BPRL_TU16BPRL1_MASK                  equ 0002h
TU16BPRL_TU16BPRL2_POSN                  equ 0002h
TU16BPRL_TU16BPRL2_POSITION              equ 0002h
TU16BPRL_TU16BPRL2_SIZE                  equ 0001h
TU16BPRL_TU16BPRL2_LENGTH                equ 0001h
TU16BPRL_TU16BPRL2_MASK                  equ 0004h
TU16BPRL_TU16BPRL3_POSN                  equ 0003h
TU16BPRL_TU16BPRL3_POSITION              equ 0003h
TU16BPRL_TU16BPRL3_SIZE                  equ 0001h
TU16BPRL_TU16BPRL3_LENGTH                equ 0001h
TU16BPRL_TU16BPRL3_MASK                  equ 0008h
TU16BPRL_TU16BPRL4_POSN                  equ 0004h
TU16BPRL_TU16BPRL4_POSITION              equ 0004h
TU16BPRL_TU16BPRL4_SIZE                  equ 0001h
TU16BPRL_TU16BPRL4_LENGTH                equ 0001h
TU16BPRL_TU16BPRL4_MASK                  equ 0010h
TU16BPRL_TU16BPRL5_POSN                  equ 0005h
TU16BPRL_TU16BPRL5_POSITION              equ 0005h
TU16BPRL_TU16BPRL5_SIZE                  equ 0001h
TU16BPRL_TU16BPRL5_LENGTH                equ 0001h
TU16BPRL_TU16BPRL5_MASK                  equ 0020h
TU16BPRL_TU16BPRL6_POSN                  equ 0006h
TU16BPRL_TU16BPRL6_POSITION              equ 0006h
TU16BPRL_TU16BPRL6_SIZE                  equ 0001h
TU16BPRL_TU16BPRL6_LENGTH                equ 0001h
TU16BPRL_TU16BPRL6_MASK                  equ 0040h
TU16BPRL_TU16BPRL7_POSN                  equ 0007h
TU16BPRL_TU16BPRL7_POSITION              equ 0007h
TU16BPRL_TU16BPRL7_SIZE                  equ 0001h
TU16BPRL_TU16BPRL7_LENGTH                equ 0001h
TU16BPRL_TU16BPRL7_MASK                  equ 0080h
TU16BPRL_TU16BPR0_POSN                   equ 0000h
TU16BPRL_TU16BPR0_POSITION               equ 0000h
TU16BPRL_TU16BPR0_SIZE                   equ 0001h
TU16BPRL_TU16BPR0_LENGTH                 equ 0001h
TU16BPRL_TU16BPR0_MASK                   equ 0001h
TU16BPRL_TU16BPR1_POSN                   equ 0001h
TU16BPRL_TU16BPR1_POSITION               equ 0001h
TU16BPRL_TU16BPR1_SIZE                   equ 0001h
TU16BPRL_TU16BPR1_LENGTH                 equ 0001h
TU16BPRL_TU16BPR1_MASK                   equ 0002h
TU16BPRL_TU16BPR2_POSN                   equ 0002h
TU16BPRL_TU16BPR2_POSITION               equ 0002h
TU16BPRL_TU16BPR2_SIZE                   equ 0001h
TU16BPRL_TU16BPR2_LENGTH                 equ 0001h
TU16BPRL_TU16BPR2_MASK                   equ 0004h
TU16BPRL_TU16BPR3_POSN                   equ 0003h
TU16BPRL_TU16BPR3_POSITION               equ 0003h
TU16BPRL_TU16BPR3_SIZE                   equ 0001h
TU16BPRL_TU16BPR3_LENGTH                 equ 0001h
TU16BPRL_TU16BPR3_MASK                   equ 0008h
TU16BPRL_TU16BPR4_POSN                   equ 0004h
TU16BPRL_TU16BPR4_POSITION               equ 0004h
TU16BPRL_TU16BPR4_SIZE                   equ 0001h
TU16BPRL_TU16BPR4_LENGTH                 equ 0001h
TU16BPRL_TU16BPR4_MASK                   equ 0010h
TU16BPRL_TU16BPR5_POSN                   equ 0005h
TU16BPRL_TU16BPR5_POSITION               equ 0005h
TU16BPRL_TU16BPR5_SIZE                   equ 0001h
TU16BPRL_TU16BPR5_LENGTH                 equ 0001h
TU16BPRL_TU16BPR5_MASK                   equ 0020h
TU16BPRL_TU16BPR6_POSN                   equ 0006h
TU16BPRL_TU16BPR6_POSITION               equ 0006h
TU16BPRL_TU16BPR6_SIZE                   equ 0001h
TU16BPRL_TU16BPR6_LENGTH                 equ 0001h
TU16BPRL_TU16BPR6_MASK                   equ 0040h
TU16BPRL_TU16BPR7_POSN                   equ 0007h
TU16BPRL_TU16BPR7_POSITION               equ 0007h
TU16BPRL_TU16BPR7_SIZE                   equ 0001h
TU16BPRL_TU16BPR7_LENGTH                 equ 0001h
TU16BPRL_TU16BPR7_MASK                   equ 0080h

