garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
// Register: ODCONF
#define ODCONF ODCONF
ODCONF                                   equ 042Ah
// bitfield definitions
ODCONF_ODCF0_POSN                        equ 0000h
ODCONF_ODCF0_POSITION                    equ 0000h
ODCONF_ODCF0_SIZE                        equ 0001h
ODCONF_ODCF0_LENGTH                      equ 0001h
ODCONF_ODCF0_MASK                        equ 0001h
ODCONF_ODCF1_POSN                        equ 0001h
ODCONF_ODCF1_POSITION                    equ 0001h
ODCONF_ODCF1_SIZE                        equ 0001h
ODCONF_ODCF1_LENGTH                      equ 0001h
ODCONF_ODCF1_MASK                        equ 0002h
ODCONF_ODCF2_POSN                        equ 0002h
ODCONF_ODCF2_POSITION                    equ 0002h
ODCONF_ODCF2_SIZE                        equ 0001h
ODCONF_ODCF2_LENGTH                      equ 0001h
ODCONF_ODCF2_MASK                        equ 0004h
ODCONF_ODCF3_POSN                        equ 0003h
ODCONF_ODCF3_POSITION                    equ 0003h
ODCONF_ODCF3_SIZE                        equ 0001h
ODCONF_ODCF3_LENGTH                      equ 0001h
ODCONF_ODCF3_MASK                        equ 0008h
ODCONF_ODCF4_POSN                        equ 0004h
ODCONF_ODCF4_POSITION                    equ 0004h
ODCONF_ODCF4_SIZE                        equ 0001h
ODCONF_ODCF4_LENGTH                      equ 0001h
ODCONF_ODCF4_MASK                        equ 0010h
ODCONF_ODCF5_POSN                        equ 0005h
ODCONF_ODCF5_POSITION                    equ 0005h
ODCONF_ODCF5_SIZE                        equ 0001h
ODCONF_ODCF5_LENGTH                      equ 0001h
ODCONF_ODCF5_MASK                        equ 0020h
ODCONF_ODCF6_POSN                        equ 0006h
ODCONF_ODCF6_POSITION                    equ 0006h
ODCONF_ODCF6_SIZE                        equ 0001h
ODCONF_ODCF6_LENGTH                      equ 0001h
ODCONF_ODCF6_MASK                        equ 0040h
ODCONF_ODCF7_POSN                        equ 0007h
ODCONF_ODCF7_POSITION                    equ 0007h
ODCONF_ODCF7_SIZE                        equ 0001h
ODCONF_ODCF7_LENGTH                      equ 0001h
ODCONF_ODCF7_MASK                        equ 0080h

// Register: SLRCONF
#define SLRCONF SLRCONF
SLRCONF                                  equ 042Bh
// bitfield definitions
SLRCONF_SLRF0_POSN                       equ 0000h
SLRCONF_SLRF0_POSITION                   equ 0000h
SLRCONF_SLRF0_SIZE                       equ 0001h
SLRCONF_SLRF0_LENGTH                     equ 0001h
SLRCONF_SLRF0_MASK                       equ 0001h
SLRCONF_SLRF1_POSN                       equ 0001h
SLRCONF_SLRF1_POSITION                   equ 0001h
SLRCONF_SLRF1_SIZE                       equ 0001h
SLRCONF_SLRF1_LENGTH                     equ 0001h
SLRCONF_SLRF1_MASK                       equ 0002h
SLRCONF_SLRF2_POSN                       equ 0002h
SLRCONF_SLRF2_POSITION                   equ 0002h
SLRCONF_SLRF2_SIZE                       equ 0001h
SLRCONF_SLRF2_LENGTH                     equ 0001h
SLRCONF_SLRF2_MASK                       equ 0004h
SLRCONF_SLRF3_POSN                       equ 0003h
SLRCONF_SLRF3_POSITION                   equ 0003h
SLRCONF_SLRF3_SIZE                       equ 0001h
SLRCONF_SLRF3_LENGTH                     equ 0001h
SLRCONF_SLRF3_MASK                       equ 0008h
SLRCONF_SLRF4_POSN                       equ 0004h
SLRCONF_SLRF4_POSITION                   equ 0004h
SLRCONF_SLRF4_SIZE                       equ 0001h
SLRCONF_SLRF4_LENGTH                     equ 0001h
SLRCONF_SLRF4_MASK                       equ 0010h
SLRCONF_SLRF5_POSN                       equ 0005h
SLRCONF_SLRF5_POSITION                   equ 0005h
SLRCONF_SLRF5_SIZE                       equ 0001h
SLRCONF_SLRF5_LENGTH                     equ 0001h
SLRCONF_SLRF5_MASK                       equ 0020h
SLRCONF_SLRF6_POSN                       equ 0006h
SLRCONF_SLRF6_POSITION                   equ 0006h
SLRCONF_SLRF6_SIZE                       equ 0001h
SLRCONF_SLRF6_LENGTH                     equ 0001h
SLRCONF_SLRF6_MASK                       equ 0040h
SLRCONF_SLRF7_POSN                       equ 0007h
SLRCONF_SLRF7_POSITION                   equ 0007h
SLRCONF_SLRF7_SIZE                       equ 0001h
SLRCONF_SLRF7_LENGTH                     equ 0001h
SLRCONF_SLRF7_MASK                       equ 0080h

// Register: INLVLF
#define INLVLF INLVLF
INLVLF                                   equ 042Ch
// bitfield definitions
INLVLF_INLVLF0_POSN                      equ 0000h
INLVLF_INLVLF0_POSITION                  equ 0000h
INLVLF_INLVLF0_SIZE                      equ 0001h
INLVLF_INLVLF0_LENGTH                    equ 0001h
INLVLF_INLVLF0_MASK                      equ 0001h
INLVLF_INLVLF1_POSN                      equ 0001h
INLVLF_INLVLF1_POSITION                  equ 0001h
INLVLF_INLVLF1_SIZE                      equ 0001h
INLVLF_INLVLF1_LENGTH                    equ 0001h
INLVLF_INLVLF1_MASK                      equ 0002h
INLVLF_INLVLF2_POSN                      equ 0002h
INLVLF_INLVLF2_POSITION                  equ 0002h
INLVLF_INLVLF2_SIZE                      equ 0001h
INLVLF_INLVLF2_LENGTH                    equ 0001h
INLVLF_INLVLF2_MASK                      equ 0004h
INLVLF_INLVLF3_POSN                      equ 0003h
INLVLF_INLVLF3_POSITION                  equ 0003h
INLVLF_INLVLF3_SIZE                      equ 0001h
INLVLF_INLVLF3_LENGTH                    equ 0001h
INLVLF_INLVLF3_MASK                      equ 0008h
INLVLF_INLVLF4_POSN                      equ 0004h
INLVLF_INLVLF4_POSITION                  equ 0004h
INLVLF_INLVLF4_SIZE                      equ 0001h
INLVLF_INLVLF4_LENGTH                    equ 0001h
INLVLF_INLVLF4_MASK                      equ 0010h
INLVLF_INLVLF5_POSN                      equ 0005h
INLVLF_INLVLF5_POSITION                  equ 0005h
INLVLF_INLVLF5_SIZE                      equ 0001h
INLVLF_INLVLF5_LENGTH                    equ 0001h
INLVLF_INLVLF5_MASK                      equ 0020h
INLVLF_INLVLF6_POSN                      equ 0006h
INLVLF_INLVLF6_POSITION                  equ 0006h
INLVLF_INLVLF6_SIZE                      equ 0001h
INLVLF_INLVLF6_LENGTH                    equ 0001h
INLVLF_INLVLF6_MASK                      equ 0040h
INLVLF_INLVLF7_POSN                      equ 0007h
INLVLF_INLVLF7_POSITION                  equ 0007h
INLVLF_INLVLF7_SIZE                      equ 0001h
INLVLF_INLVLF7_LENGTH                    equ 0001h
INLVLF_INLVLF7_MASK                      equ 0080h

// Register: IOCWP
#define IOCWP IOCWP
IOCWP                                    equ 043Dh
// bitfield definitions
IOCWP_IOCWP0_POSN                        equ 0000h
IOCWP_IOCWP0_POSITION                    equ 0000h
IOCWP_IOCWP0_SIZE                        equ 0001h
IOCWP_IOCWP0_LENGTH                      equ 0001h
IOCWP_IOCWP0_MASK                        equ 0001h
IOCWP_IOCWP1_POSN                        equ 0001h
IOCWP_IOCWP1_POSITION                    equ 0001h
IOCWP_IOCWP1_SIZE                        equ 0001h
IOCWP_IOCWP1_LENGTH                      equ 0001h
IOCWP_IOCWP1_MASK                        equ 0002h
IOCWP_IOCWP2_POSN                        equ 0002h
IOCWP_IOCWP2_POSITION                    equ 0002h
IOCWP_IOCWP2_SIZE                        equ 0001h
IOCWP_IOCWP2_LENGTH                      equ 0001h
IOCWP_IOCWP2_MASK                        equ 0004h
IOCWP_IOCWP3_POSN                        equ 0003h
IOCWP_IOCWP3_POSITION                    equ 0003h
IOCWP_IOCWP3_SIZE                        equ 0001h
IOCWP_IOCWP3_LENGTH                      equ 0001h
IOCWP_IOCWP3_MASK                        equ 0008h
IOCWP_IOCWP4_POSN                        equ 0004h
IOCWP_IOCWP4_POSITION                    equ 0004h
IOCWP_IOCWP4_SIZE                        equ 0001h
IOCWP_IOCWP4_LENGTH                      equ 0001h
IOCWP_IOCWP4_MASK                        equ 0010h
IOCWP_IOCWP5_POSN                        equ 0005h
IOCWP_IOCWP5_POSITION                    equ 0005h
IOCWP_IOCWP5_SIZE                        equ 0001h
IOCWP_IOCWP5_LENGTH                      equ 0001h
IOCWP_IOCWP5_MASK                        equ 0020h
IOCWP_IOCWP6_POSN                        equ 0006h
IOCWP_IOCWP6_POSITION                    equ 0006h
IOCWP_IOCWP6_SIZE                        equ 0001h
IOCWP_IOCWP6_LENGTH                      equ 0001h
IOCWP_IOCWP6_MASK                        equ 0040h
IOCWP_IOCWP7_POSN                        equ 0007h
IOCWP_IOCWP7_POSITION                    equ 0007h
IOCWP_IOCWP7_SIZE                        equ 0001h
IOCWP_IOCWP7_LENGTH                      equ 0001h
IOCWP_IOCWP7_MASK                        equ 0080h

// Register: IOCWN
#define IOCWN IOCWN
IOCWN                                    equ 043Eh
// bitfield definitions
IOCWN_IOCWN0_POSN                        equ 0000h
IOCWN_IOCWN0_POSITION                    equ 0000h
IOCWN_IOCWN0_SIZE                        equ 0001h
IOCWN_IOCWN0_LENGTH                      equ 0001h
IOCWN_IOCWN0_MASK                        equ 0001h
IOCWN_IOCWN1_POSN                        equ 0001h
IOCWN_IOCWN1_POSITION                    equ 0001h
IOCWN_IOCWN1_SIZE                        equ 0001h
IOCWN_IOCWN1_LENGTH                      equ 0001h
IOCWN_IOCWN1_MASK                        equ 0002h
IOCWN_IOCWN2_POSN                        equ 0002h
IOCWN_IOCWN2_POSITION                    equ 0002h
IOCWN_IOCWN2_SIZE                        equ 0001h
IOCWN_IOCWN2_LENGTH                      equ 0001h
IOCWN_IOCWN2_MASK                        equ 0004h
IOCWN_IOCWN3_POSN                        equ 0003h
IOCWN_IOCWN3_POSITION                    equ 0003h
IOCWN_IOCWN3_SIZE                        equ 0001h
IOCWN_IOCWN3_LENGTH                      equ 0001h
IOCWN_IOCWN3_MASK                        equ 0008h
IOCWN_IOCWN4_POSN                        equ 0004h
IOCWN_IOCWN4_POSITION                    equ 0004h
IOCWN_IOCWN4_SIZE                        equ 0001h
IOCWN_IOCWN4_LENGTH                      equ 0001h
IOCWN_IOCWN4_MASK                        equ 0010h
IOCWN_IOCWN5_POSN                        equ 0005h
IOCWN_IOCWN5_POSITION                    equ 0005h
IOCWN_IOCWN5_SIZE                        equ 0001h
IOCWN_IOCWN5_LENGTH                      equ 0001h
IOCWN_IOCWN5_MASK                        equ 0020h
IOCWN_IOCWN6_POSN                        equ 0006h
IOCWN_IOCWN6_POSITION                    equ 0006h
IOCWN_IOCWN6_SIZE                        equ 0001h
IOCWN_IOCWN6_LENGTH                      equ 0001h
IOCWN_IOCWN6_MASK                        equ 0040h
IOCWN_IOCWN7_POSN                        equ 0007h
IOCWN_IOCWN7_POSITION                    equ 0007h
IOCWN_IOCWN7_SIZE                        equ 0001h
IOCWN_IOCWN7_LENGTH                      equ 0001h
IOCWN_IOCWN7_MASK                        equ 0080h

// Register: IOCWF
#define IOCWF IOCWF
IOCWF                                    equ 043Fh
// bitfield definitions
IOCWF_IOCWF0_POSN                        equ 0000h
IOCWF_IOCWF0_POSITION                    equ 0000h
IOCWF_IOCWF0_SIZE                        equ 0001h
IOCWF_IOCWF0_LENGTH                      equ 0001h
IOCWF_IOCWF0_MASK                        equ 0001h
IOCWF_IOCWF1_POSN                        equ 0001h
IOCWF_IOCWF1_POSITION                    equ 0001h
IOCWF_IOCWF1_SIZE                        equ 0001h
IOCWF_IOCWF1_LENGTH                      equ 0001h
IOCWF_IOCWF1_MASK                        equ 0002h
IOCWF_IOCWF2_POSN                        equ 0002h
IOCWF_IOCWF2_POSITION                    equ 0002h
IOCWF_IOCWF2_SIZE                        equ 0001h
IOCWF_IOCWF2_LENGTH                      equ 0001h
IOCWF_IOCWF2_MASK                        equ 0004h
IOCWF_IOCWF3_POSN                        equ 0003h
IOCWF_IOCWF3_POSITION                    equ 0003h
IOCWF_IOCWF3_SIZE                        equ 0001h
IOCWF_IOCWF3_LENGTH                      equ 0001h
IOCWF_IOCWF3_MASK                        equ 0008h
IOCWF_IOCWF4_POSN                        equ 0004h
IOCWF_IOCWF4_POSITION                    equ 0004h
IOCWF_IOCWF4_SIZE                        equ 0001h
IOCWF_IOCWF4_LENGTH                      equ 0001h
IOCWF_IOCWF4_MASK                        equ 0010h
IOCWF_IOCWF5_POSN                        equ 0005h
IOCWF_IOCWF5_POSITION                    equ 0005h
IOCWF_IOCWF5_SIZE                        equ 0001h
IOCWF_IOCWF5_LENGTH                      equ 0001h
IOCWF_IOCWF5_MASK                        equ 0020h
IOCWF_IOCWF6_POSN                        equ 0006h
IOCWF_IOCWF6_POSITION                    equ 0006h
IOCWF_IOCWF6_SIZE                        equ 0001h
IOCWF_IOCWF6_LENGTH                      equ 0001h
IOCWF_IOCWF6_MASK                        equ 0040h
IOCWF_IOCWF7_POSN                        equ 0007h
IOCWF_IOCWF7_POSITION                    equ 0007h
IOCWF_IOCWF7_SIZE                        equ 0001h
IOCWF_IOCWF7_LENGTH                      equ 0001h
IOCWF_IOCWF7_MASK                        equ 0080h

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
NCO1ACC                                  equ 0440h

