garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
// Register: PWM2CLK
#define PWM2CLK PWM2CLK
PWM2CLK                                  equ 0470h
// bitfield definitions
PWM2CLK_CLK_POSN                         equ 0000h
PWM2CLK_CLK_POSITION                     equ 0000h
PWM2CLK_CLK_SIZE                         equ 0008h
PWM2CLK_CLK_LENGTH                       equ 0008h
PWM2CLK_CLK_MASK                         equ 00FFh
PWM2CLK_CLK0_POSN                        equ 0000h
PWM2CLK_CLK0_POSITION                    equ 0000h
PWM2CLK_CLK0_SIZE                        equ 0001h
PWM2CLK_CLK0_LENGTH                      equ 0001h
PWM2CLK_CLK0_MASK                        equ 0001h
PWM2CLK_CLK1_POSN                        equ 0001h
PWM2CLK_CLK1_POSITION                    equ 0001h
PWM2CLK_CLK1_SIZE                        equ 0001h
PWM2CLK_CLK1_LENGTH                      equ 0001h
PWM2CLK_CLK1_MASK                        equ 0002h
PWM2CLK_CLK2_POSN                        equ 0002h
PWM2CLK_CLK2_POSITION                    equ 0002h
PWM2CLK_CLK2_SIZE                        equ 0001h
PWM2CLK_CLK2_LENGTH                      equ 0001h
PWM2CLK_CLK2_MASK                        equ 0004h
PWM2CLK_CLK3_POSN                        equ 0003h
PWM2CLK_CLK3_POSITION                    equ 0003h
PWM2CLK_CLK3_SIZE                        equ 0001h
PWM2CLK_CLK3_LENGTH                      equ 0001h
PWM2CLK_CLK3_MASK                        equ 0008h
PWM2CLK_CLK4_POSN                        equ 0004h
PWM2CLK_CLK4_POSITION                    equ 0004h
PWM2CLK_CLK4_SIZE                        equ 0001h
PWM2CLK_CLK4_LENGTH                      equ 0001h
PWM2CLK_CLK4_MASK                        equ 0010h
PWM2CLK_CLK5_POSN                        equ 0005h
PWM2CLK_CLK5_POSITION                    equ 0005h
PWM2CLK_CLK5_SIZE                        equ 0001h
PWM2CLK_CLK5_LENGTH                      equ 0001h
PWM2CLK_CLK5_MASK                        equ 0020h
PWM2CLK_CLK6_POSN                        equ 0006h
PWM2CLK_CLK6_POSITION                    equ 0006h
PWM2CLK_CLK6_SIZE                        equ 0001h
PWM2CLK_CLK6_LENGTH                      equ 0001h
PWM2CLK_CLK6_MASK                        equ 0040h
PWM2CLK_CLK7_POSN                        equ 0007h
PWM2CLK_CLK7_POSITION                    equ 0007h
PWM2CLK_CLK7_SIZE                        equ 0001h
PWM2CLK_CLK7_LENGTH                      equ 0001h
PWM2CLK_CLK7_MASK                        equ 0080h

// Register: PWM2LDS
#define PWM2LDS PWM2LDS
PWM2LDS                                  equ 0471h
// bitfield definitions
PWM2LDS_LDS_POSN                         equ 0000h
PWM2LDS_LDS_POSITION                     equ 0000h
PWM2LDS_LDS_SIZE                         equ 0008h
PWM2LDS_LDS_LENGTH                       equ 0008h
PWM2LDS_LDS_MASK                         equ 00FFh
PWM2LDS_LDS0_POSN                        equ 0000h
PWM2LDS_LDS0_POSITION                    equ 0000h
PWM2LDS_LDS0_SIZE                        equ 0001h
PWM2LDS_LDS0_LENGTH                      equ 0001h
PWM2LDS_LDS0_MASK                        equ 0001h
PWM2LDS_LDS1_POSN                        equ 0001h
PWM2LDS_LDS1_POSITION                    equ 0001h
PWM2LDS_LDS1_SIZE                        equ 0001h
PWM2LDS_LDS1_LENGTH                      equ 0001h
PWM2LDS_LDS1_MASK                        equ 0002h
PWM2LDS_LDS2_POSN                        equ 0002h
PWM2LDS_LDS2_POSITION                    equ 0002h
PWM2LDS_LDS2_SIZE                        equ 0001h
PWM2LDS_LDS2_LENGTH                      equ 0001h
PWM2LDS_LDS2_MASK                        equ 0004h
PWM2LDS_LDS3_POSN                        equ 0003h
PWM2LDS_LDS3_POSITION                    equ 0003h
PWM2LDS_LDS3_SIZE                        equ 0001h
PWM2LDS_LDS3_LENGTH                      equ 0001h
PWM2LDS_LDS3_MASK                        equ 0008h
PWM2LDS_LDS4_POSN                        equ 0004h
PWM2LDS_LDS4_POSITION                    equ 0004h
PWM2LDS_LDS4_SIZE                        equ 0001h
PWM2LDS_LDS4_LENGTH                      equ 0001h
PWM2LDS_LDS4_MASK                        equ 0010h
PWM2LDS_LDS5_POSN                        equ 0005h
PWM2LDS_LDS5_POSITION                    equ 0005h
PWM2LDS_LDS5_SIZE                        equ 0001h
PWM2LDS_LDS5_LENGTH                      equ 0001h
PWM2LDS_LDS5_MASK                        equ 0020h
PWM2LDS_LDS6_POSN                        equ 0006h
PWM2LDS_LDS6_POSITION                    equ 0006h
PWM2LDS_LDS6_SIZE                        equ 0001h
PWM2LDS_LDS6_LENGTH                      equ 0001h
PWM2LDS_LDS6_MASK                        equ 0040h
PWM2LDS_LDS7_POSN                        equ 0007h
PWM2LDS_LDS7_POSITION                    equ 0007h
PWM2LDS_LDS7_SIZE                        equ 0001h
PWM2LDS_LDS7_LENGTH                      equ 0001h
PWM2LDS_LDS7_MASK                        equ 0080h

// Register: PWM2PR
#define PWM2PR PWM2PR
PWM2PR                                   equ 0472h

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
PWM2PRL                                  equ 0472h
// bitfield definitions
PWM2PRL_PRL_POSN                         equ 0000h
PWM2PRL_PRL_POSITION                     equ 0000h
PWM2PRL_PRL_SIZE                         equ 0008h
PWM2PRL_PRL_LENGTH                       equ 0008h
PWM2PRL_PRL_MASK                         equ 00FFh

// Register: PWM2PRH
#define PWM2PRH PWM2PRH
PWM2PRH                                  equ 0473h
// bitfield definitions
PWM2PRH_PRH_POSN                         equ 0000h
PWM2PRH_PRH_POSITION                     equ 0000h
PWM2PRH_PRH_SIZE                         equ 0008h
PWM2PRH_PRH_LENGTH                       equ 0008h
PWM2PRH_PRH_MASK                         equ 00FFh

// Register: PWM2CPRE
#define PWM2CPRE PWM2CPRE
PWM2CPRE                                 equ 0474h
// bitfield definitions
PWM2CPRE_CPRE_POSN                       equ 0000h
PWM2CPRE_CPRE_POSITION                   equ 0000h
PWM2CPRE_CPRE_SIZE                       equ 0008h
PWM2CPRE_CPRE_LENGTH                     equ 0008h
PWM2CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM2PIPOS
#define PWM2PIPOS PWM2PIPOS
PWM2PIPOS                                equ 0475h
// bitfield definitions
PWM2PIPOS_PIPOS_POSN                     equ 0000h
PWM2PIPOS_PIPOS_POSITION                 equ 0000h
PWM2PIPOS_PIPOS_SIZE                     equ 0008h
PWM2PIPOS_PIPOS_LENGTH                   equ 0008h
PWM2PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM2GIR
#define PWM2GIR PWM2GIR
PWM2GIR                                  equ 0476h
// bitfield definitions
PWM2GIR_S1P1IF_POSN                      equ 0000h
PWM2GIR_S1P1IF_POSITION                  equ 0000h
PWM2GIR_S1P1IF_SIZE                      equ 0001h
PWM2GIR_S1P1IF_LENGTH                    equ 0001h
PWM2GIR_S1P1IF_MASK                      equ 0001h
PWM2GIR_S1P2IF_POSN                      equ 0001h
PWM2GIR_S1P2IF_POSITION                  equ 0001h
PWM2GIR_S1P2IF_SIZE                      equ 0001h
PWM2GIR_S1P2IF_LENGTH                    equ 0001h
PWM2GIR_S1P2IF_MASK                      equ 0002h

// Register: PWM2GIE
#define PWM2GIE PWM2GIE
PWM2GIE                                  equ 0477h
// bitfield definitions
PWM2GIE_S1P1IE_POSN                      equ 0000h
PWM2GIE_S1P1IE_POSITION                  equ 0000h
PWM2GIE_S1P1IE_SIZE                      equ 0001h
PWM2GIE_S1P1IE_LENGTH                    equ 0001h
PWM2GIE_S1P1IE_MASK                      equ 0001h
PWM2GIE_S1P2IE_POSN                      equ 0001h
PWM2GIE_S1P2IE_POSITION                  equ 0001h
PWM2GIE_S1P2IE_SIZE                      equ 0001h
PWM2GIE_S1P2IE_LENGTH                    equ 0001h
PWM2GIE_S1P2IE_MASK                      equ 0002h

