garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
#define T0PR7                            BANKMASK(TMR0H), 7, b
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0, b
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1, b
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2, b
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3, b
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4, b
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5, b
#define T1CKPS0                          BANKMASK(T1CON), 4, b
#define T1CKPS1                          BANKMASK(T1CON), 5, b
#define T1CS0                            BANKMASK(T1CLK), 0, b
#define T1CS1                            BANKMASK(T1CLK), 1, b
#define T1CS2                            BANKMASK(T1CLK), 2, b
#define T1CS3                            BANKMASK(T1CLK), 3, b
#define T1CS4                            BANKMASK(T1CLK), 4, b
#define T1GE                             BANKMASK(T1GCON), 7, b
#define T1GGO                            BANKMASK(T1GCON), 3, b
#define T1GGO_NOT_DONE                   BANKMASK(T1GCON), 3, b
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3, b
#define T1GPOL                           BANKMASK(T1GCON), 6, b
#define T1GPPS0                          BANKMASK(T1GPPS), 0, b
#define T1GPPS1                          BANKMASK(T1GPPS), 1, b
#define T1GPPS2                          BANKMASK(T1GPPS), 2, b
#define T1GPPS3                          BANKMASK(T1GPPS), 3, b
#define T1GPPS4                          BANKMASK(T1GPPS), 4, b
#define T1GPPS5                          BANKMASK(T1GPPS), 5, b
#define T1GSPM                           BANKMASK(T1GCON), 4, b
#define T1GSS0                           BANKMASK(T1GATE), 0, b
#define T1GSS1                           BANKMASK(T1GATE), 1, b
#define T1GSS2                           BANKMASK(T1GATE), 2, b
#define T1GSS3                           BANKMASK(T1GATE), 3, b
#define T1GSS4                           BANKMASK(T1GATE), 4, b
#define T1GTM                            BANKMASK(T1GCON), 5, b
#define T1GVAL                           BANKMASK(T1GCON), 2, b
#define T1RD16                           BANKMASK(T1CON), 1, b
#define T2CKPOL                          BANKMASK(T2HLT), 6, b
#define T2CKPS0                          BANKMASK(T2CON), 4, b
#define T2CKPS1                          BANKMASK(T2CON), 5, b
#define T2CKPS2                          BANKMASK(T2CON), 6, b
#define T2CKSYNC                         BANKMASK(T2HLT), 5, b
#define T2CS0                            BANKMASK(T2CLKCON), 0, b
#define T2CS1                            BANKMASK(T2CLKCON), 1, b
#define T2CS2                            BANKMASK(T2CLKCON), 2, b
#define T2CS3                            BANKMASK(T2CLKCON), 3, b
#define T2CS4                            BANKMASK(T2CLKCON), 4, b
#define T2INPPS0                         BANKMASK(T2INPPS), 0, b
#define T2INPPS1                         BANKMASK(T2INPPS), 1, b
#define T2INPPS2                         BANKMASK(T2INPPS), 2, b
#define T2INPPS3                         BANKMASK(T2INPPS), 3, b
#define T2INPPS4                         BANKMASK(T2INPPS), 4, b
#define T2INPPS5                         BANKMASK(T2INPPS), 5, b
#define T2MODE0                          BANKMASK(T2HLT), 0, b
#define T2MODE1                          BANKMASK(T2HLT), 1, b
#define T2MODE2                          BANKMASK(T2HLT), 2, b
#define T2MODE3                          BANKMASK(T2HLT), 3, b
#define T2MODE4                          BANKMASK(T2HLT), 4, b
#define T2ON                             BANKMASK(T2CON), 7, b
#define T2OUTPS0                         BANKMASK(T2CON), 0, b
#define T2OUTPS1                         BANKMASK(T2CON), 1, b
#define T2OUTPS2                         BANKMASK(T2CON), 2, b
#define T2OUTPS3                         BANKMASK(T2CON), 3, b
#define T2PSYNC                          BANKMASK(T2HLT), 7, b
#define T2RSEL0                          BANKMASK(T2RST), 0, b
#define T2RSEL1                          BANKMASK(T2RST), 1, b
#define T2RSEL2                          BANKMASK(T2RST), 2, b
#define T2RSEL3                          BANKMASK(T2RST), 3, b
#define T2RSEL4                          BANKMASK(T2RST), 4, b
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0, b
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1, b
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2, b
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3, b
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4, b
#define T3CKIPPS5                        BANKMASK(T3CKIPPS), 5, b
#define T3CKPS0                          BANKMASK(T3CON), 4, b
#define T3CKPS1                          BANKMASK(T3CON), 5, b
#define T3CS0                            BANKMASK(T3CLK), 0, b
#define T3CS1                            BANKMASK(T3CLK), 1, b
#define T3CS2                            BANKMASK(T3CLK), 2, b
#define T3CS3                            BANKMASK(T3CLK), 3, b
#define T3CS4                            BANKMASK(T3CLK), 4, b
#define T3GE                             BANKMASK(T3GCON), 7, b
#define T3GGO                            BANKMASK(T3GCON), 3, b
#define T3GGO_NOT_DONE                   BANKMASK(T3GCON), 3, b
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3, b
#define T3GPOL                           BANKMASK(T3GCON), 6, b
#define T3GPPS0                          BANKMASK(T3GPPS), 0, b
#define T3GPPS1                          BANKMASK(T3GPPS), 1, b
#define T3GPPS2                          BANKMASK(T3GPPS), 2, b
#define T3GPPS3                          BANKMASK(T3GPPS), 3, b
#define T3GPPS4                          BANKMASK(T3GPPS), 4, b
#define T3GPPS5                          BANKMASK(T3GPPS), 5, b
#define T3GSPM                           BANKMASK(T3GCON), 4, b
#define T3GSS0                           BANKMASK(T3GATE), 0, b
#define T3GSS1                           BANKMASK(T3GATE), 1, b
#define T3GSS2                           BANKMASK(T3GATE), 2, b
#define T3GSS3                           BANKMASK(T3GATE), 3, b
#define T3GSS4                           BANKMASK(T3GATE), 4, b
#define T3GTM                            BANKMASK(T3GCON), 5, b
#define T3GVAL                           BANKMASK(T3GCON), 2, b
#define T3RD16                           BANKMASK(T3CON), 1, b
#define T4CKPOL                          BANKMASK(T4HLT), 6, b
#define T4CKPS0                          BANKMASK(T4CON), 4, b
#define T4CKPS1                          BANKMASK(T4CON), 5, b
#define T4CKPS2                          BANKMASK(T4CON), 6, b
#define T4CKSYNC                         BANKMASK(T4HLT), 5, b
#define T4CS0                            BANKMASK(T4CLKCON), 0, b
#define T4CS1                            BANKMASK(T4CLKCON), 1, b
#define T4CS2                            BANKMASK(T4CLKCON), 2, b
#define T4CS3                            BANKMASK(T4CLKCON), 3, b
#define T4CS4                            BANKMASK(T4CLKCON), 4, b
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
#define T4INPPS1                         BANKMASK(T4INPPS), 1, b
#define T4INPPS2                         BANKMASK(T4INPPS), 2, b
#define T4INPPS3                         BANKMASK(T4INPPS), 3, b
#define T4INPPS4                         BANKMASK(T4INPPS), 4, b
#define T4INPPS5                         BANKMASK(T4INPPS), 5, b
#define T4MODE0                          BANKMASK(T4HLT), 0, b
#define T4MODE1                          BANKMASK(T4HLT), 1, b
#define T4MODE2                          BANKMASK(T4HLT), 2, b
#define T4MODE3                          BANKMASK(T4HLT), 3, b
#define T4MODE4                          BANKMASK(T4HLT), 4, b
#define T4ON                             BANKMASK(T4CON), 7, b
#define T4OUTPS0                         BANKMASK(T4CON), 0, b
#define T4OUTPS1                         BANKMASK(T4CON), 1, b
#define T4OUTPS2                         BANKMASK(T4CON), 2, b
#define T4OUTPS3                         BANKMASK(T4CON), 3, b
#define T4PSYNC                          BANKMASK(T4HLT), 7, b
#define T4RSEL0                          BANKMASK(T4RST), 0, b
#define T4RSEL1                          BANKMASK(T4RST), 1, b
#define T4RSEL2                          BANKMASK(T4RST), 2, b
#define T4RSEL3                          BANKMASK(T4RST), 3, b
#define T4RSEL4                          BANKMASK(T4RST), 4, b
#define TCZIE                            BANKMASK(SPI1INTE), 6, b
#define TCZIF                            BANKMASK(SPI1INTF), 6, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0H0                           BANKMASK(TMR0H), 0, b
#define TMR0H1                           BANKMASK(TMR0H), 1, b
#define TMR0H2                           BANKMASK(TMR0H), 2, b
#define TMR0H3                           BANKMASK(TMR0H), 3, b
#define TMR0H4                           BANKMASK(TMR0H), 4, b
#define TMR0H5                           BANKMASK(TMR0H), 5, b
#define TMR0H6                           BANKMASK(TMR0H), 6, b
#define TMR0H7                           BANKMASK(TMR0H), 7, b
#define TMR0IE                           BANKMASK(PIE3), 7, a
#define TMR0IF                           BANKMASK(PIR3), 7, a
#define TMR0IP                           BANKMASK(IPR3), 7, a
#define TMR0L0                           BANKMASK(TMR0L), 0, b
#define TMR0L1                           BANKMASK(TMR0L), 1, b
#define TMR0L2                           BANKMASK(TMR0L), 2, b
#define TMR0L3                           BANKMASK(TMR0L), 3, b
#define TMR0L4                           BANKMASK(TMR0L), 4, b
#define TMR0L5                           BANKMASK(TMR0L), 5, b
#define TMR0L6                           BANKMASK(TMR0L), 6, b
#define TMR0L7                           BANKMASK(TMR0L), 7, b
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR10                            BANKMASK(TMR1L), 0, b
#define TMR11                            BANKMASK(TMR1L), 1, b
#define TMR110                           BANKMASK(TMR1H), 2, b
#define TMR111                           BANKMASK(TMR1H), 3, b
#define TMR112                           BANKMASK(TMR1H), 4, b
#define TMR113                           BANKMASK(TMR1H), 5, b
#define TMR114                           BANKMASK(TMR1H), 6, b
#define TMR115                           BANKMASK(TMR1H), 7, b
#define TMR12                            BANKMASK(TMR1L), 2, b
#define TMR13                            BANKMASK(TMR1L), 3, b
#define TMR14                            BANKMASK(TMR1L), 4, b
#define TMR15                            BANKMASK(TMR1L), 5, b
#define TMR16                            BANKMASK(TMR1L), 6, b
#define TMR17                            BANKMASK(TMR1L), 7, b
#define TMR18                            BANKMASK(TMR1H), 0, b
#define TMR19                            BANKMASK(TMR1H), 1, b
#define TMR1GIE                          BANKMASK(PIE3), 5, a
#define TMR1GIF                          BANKMASK(PIR3), 5, a
#define TMR1GIP                          BANKMASK(IPR3), 5, a
#define TMR1H0                           BANKMASK(TMR1H), 0, b
#define TMR1H1                           BANKMASK(TMR1H), 1, b
#define TMR1H2                           BANKMASK(TMR1H), 2, b
#define TMR1H3                           BANKMASK(TMR1H), 3, b
#define TMR1H4                           BANKMASK(TMR1H), 4, b
#define TMR1H5                           BANKMASK(TMR1H), 5, b
#define TMR1H6                           BANKMASK(TMR1H), 6, b
#define TMR1H7                           BANKMASK(TMR1H), 7, b
#define TMR1IE                           BANKMASK(PIE3), 4, a
#define TMR1IF                           BANKMASK(PIR3), 4, a
#define TMR1IP                           BANKMASK(IPR3), 4, a
#define TMR1L0                           BANKMASK(TMR1L), 0, b
#define TMR1L1                           BANKMASK(TMR1L), 1, b
#define TMR1L2                           BANKMASK(TMR1L), 2, b
#define TMR1L3                           BANKMASK(TMR1L), 3, b
#define TMR1L4                           BANKMASK(TMR1L), 4, b
#define TMR1L5                           BANKMASK(TMR1L), 5, b
#define TMR1L6                           BANKMASK(TMR1L), 6, b
#define TMR1L7                           BANKMASK(TMR1L), 7, b
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, b
#define TMR2IE                           BANKMASK(PIE3), 3, a
#define TMR2IF                           BANKMASK(PIR3), 3, a
#define TMR2IP                           BANKMASK(IPR3), 3, a
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, b
#define TMR30                            BANKMASK(TMR3L), 0, b
#define TMR31                            BANKMASK(TMR3L), 1, b
#define TMR310                           BANKMASK(TMR3H), 2, b
#define TMR311                           BANKMASK(TMR3H), 3, b
#define TMR312                           BANKMASK(TMR3H), 4, b
#define TMR313                           BANKMASK(TMR3H), 5, b
#define TMR314                           BANKMASK(TMR3H), 6, b
#define TMR315                           BANKMASK(TMR3H), 7, b
#define TMR32                            BANKMASK(TMR3L), 2, b
#define TMR33                            BANKMASK(TMR3L), 3, b
#define TMR34                            BANKMASK(TMR3L), 4, b
#define TMR35                            BANKMASK(TMR3L), 5, b
#define TMR36                            BANKMASK(TMR3L), 6, b
#define TMR37                            BANKMASK(TMR3L), 7, b
#define TMR38                            BANKMASK(TMR3H), 0, b
#define TMR39                            BANKMASK(TMR3H), 1, b
#define TMR3GIE                          BANKMASK(PIE4), 5, a
#define TMR3GIF                          BANKMASK(PIR4), 5, a
#define TMR3GIP                          BANKMASK(IPR4), 5, a
#define TMR3H0                           BANKMASK(TMR3H), 0, b
#define TMR3H1                           BANKMASK(TMR3H), 1, b
#define TMR3H2                           BANKMASK(TMR3H), 2, b
#define TMR3H3                           BANKMASK(TMR3H), 3, b
#define TMR3H4                           BANKMASK(TMR3H), 4, b
#define TMR3H5                           BANKMASK(TMR3H), 5, b
#define TMR3H6                           BANKMASK(TMR3H), 6, b
#define TMR3H7                           BANKMASK(TMR3H), 7, b
#define TMR3IE                           BANKMASK(PIE4), 4, a
#define TMR3IF                           BANKMASK(PIR4), 4, a
#define TMR3IP                           BANKMASK(IPR4), 4, a
#define TMR3L0                           BANKMASK(TMR3L), 0, b
#define TMR3L1                           BANKMASK(TMR3L), 1, b
#define TMR3L2                           BANKMASK(TMR3L), 2, b
#define TMR3L3                           BANKMASK(TMR3L), 3, b
#define TMR3L4                           BANKMASK(TMR3L), 4, b
#define TMR3L5                           BANKMASK(TMR3L), 5, b
#define TMR3L6                           BANKMASK(TMR3L), 6, b
#define TMR3L7                           BANKMASK(TMR3L), 7, b
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, b
#define TMR4IE                           BANKMASK(PIE10), 3, a
#define TMR4IF                           BANKMASK(PIR10), 3, a
#define TMR4IP                           BANKMASK(IPR10), 3, a
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, b
#define TMRAOSEN                         BANKMASK(TU16ACON1), 6, b
#define TMRBOSEN                         BANKMASK(TU16BCON1), 6, b
#define TOBY32                           BANKMASK(I2C1BTO), 6, b
#define TOREC                            BANKMASK(I2C1BTO), 7, b
#define TOTIME0                          BANKMASK(I2C1BTO), 0, b
#define TOTIME1                          BANKMASK(I2C1BTO), 1, b
#define TOTIME2                          BANKMASK(I2C1BTO), 2, b
#define TOTIME3                          BANKMASK(I2C1BTO), 3, b
#define TOTIME4                          BANKMASK(I2C1BTO), 4, b
#define TOTIME5                          BANKMASK(I2C1BTO), 5, b
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, b
#define TRISA1                           BANKMASK(TRISA), 1, b
#define TRISA2                           BANKMASK(TRISA), 2, b
#define TRISA3                           BANKMASK(TRISA), 3, b
#define TRISA4                           BANKMASK(TRISA), 4, b
#define TRISA5                           BANKMASK(TRISA), 5, b
#define TRISA6                           BANKMASK(TRISA), 6, b
#define TRISA7                           BANKMASK(TRISA), 7, b
#define TRISB0                           BANKMASK(TRISB), 0, b
#define TRISB1                           BANKMASK(TRISB), 1, b
#define TRISB2                           BANKMASK(TRISB), 2, b
#define TRISB3                           BANKMASK(TRISB), 3, b
#define TRISB4                           BANKMASK(TRISB), 4, b
#define TRISB5                           BANKMASK(TRISB), 5, b
#define TRISB6                           BANKMASK(TRISB), 6, b
#define TRISB7                           BANKMASK(TRISB), 7, b
#define TRISC0                           BANKMASK(TRISC), 0, b
#define TRISC1                           BANKMASK(TRISC), 1, b
#define TRISC2                           BANKMASK(TRISC), 2, b
#define TRISC3                           BANKMASK(TRISC), 3, b
#define TRISC4                           BANKMASK(TRISC), 4, b
#define TRISC5                           BANKMASK(TRISC), 5, b
#define TRISC6                           BANKMASK(TRISC), 6, b
#define TRISC7                           BANKMASK(TRISC), 7, b
#define TRISD0                           BANKMASK(TRISD), 0, b
#define TRISD1                           BANKMASK(TRISD), 1, b
#define TRISD2                           BANKMASK(TRISD), 2, b
#define TRISD3                           BANKMASK(TRISD), 3, b
#define TRISD4                           BANKMASK(TRISD), 4, b
#define TRISD5                           BANKMASK(TRISD), 5, b
#define TRISD6                           BANKMASK(TRISD), 6, b
#define TRISD7                           BANKMASK(TRISD), 7, b
#define TRISE0                           BANKMASK(TRISE), 0, b
#define TRISE1                           BANKMASK(TRISE), 1, b
#define TRISE2                           BANKMASK(TRISE), 2, b
#define TRISF0                           BANKMASK(TRISF), 0, b
#define TRISF1                           BANKMASK(TRISF), 1, b
#define TRISF2                           BANKMASK(TRISF), 2, b
#define TRISF3                           BANKMASK(TRISF), 3, b
#define TRISF4                           BANKMASK(TRISF), 4, b
#define TRISF5                           BANKMASK(TRISF), 5, b
#define TRISF6                           BANKMASK(TRISF), 6, b
#define TRISF7                           BANKMASK(TRISF), 7, b
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEL4                            BANKMASK(SCANTRIG), 4, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TU16ACAPT                        BANKMASK(TU16ACON1), 3, b
#define TU16ACIE                         BANKMASK(TU16ACON0), 0, b
#define TU16ACIF                         BANKMASK(TU16ACON1), 0, b
#define TU16ACLK0                        BANKMASK(TU16ACLK), 0, b
#define TU16ACLK1                        BANKMASK(TU16ACLK), 1, b
#define TU16ACLK2                        BANKMASK(TU16ACLK), 2, b
#define TU16ACLK3                        BANKMASK(TU16ACLK), 3, b
#define TU16ACLK4                        BANKMASK(TU16ACLK), 4, b
#define TU16ACLR                         BANKMASK(TU16ACON1), 5, b
#define TU16ACPOL                        BANKMASK(TU16ACON0), 6, b
#define TU16ACR0                         BANKMASK(TU16ACRL), 0, b
#define TU16ACR1                         BANKMASK(TU16ACRL), 1, b
#define TU16ACR10                        BANKMASK(TU16ACRH), 2, b
#define TU16ACR11                        BANKMASK(TU16ACRH), 3, b
#define TU16ACR12                        BANKMASK(TU16ACRH), 4, b
#define TU16ACR13                        BANKMASK(TU16ACRH), 5, b
#define TU16ACR14                        BANKMASK(TU16ACRH), 6, b
#define TU16ACR15                        BANKMASK(TU16ACRH), 7, b
#define TU16ACR2                         BANKMASK(TU16ACRL), 2, b
#define TU16ACR3                         BANKMASK(TU16ACRL), 3, b
#define TU16ACR4                         BANKMASK(TU16ACRL), 4, b
#define TU16ACR5                         BANKMASK(TU16ACRL), 5, b
#define TU16ACR6                         BANKMASK(TU16ACRL), 6, b
#define TU16ACR7                         BANKMASK(TU16ACRL), 7, b
#define TU16ACR8                         BANKMASK(TU16ACRH), 0, b
#define TU16ACR9                         BANKMASK(TU16ACRH), 1, b
#define TU16ACRH0                        BANKMASK(TU16ACRH), 0, b
#define TU16ACRH1                        BANKMASK(TU16ACRH), 1, b
#define TU16ACRH2                        BANKMASK(TU16ACRH), 2, b
#define TU16ACRH3                        BANKMASK(TU16ACRH), 3, b
#define TU16ACRH4                        BANKMASK(TU16ACRH), 4, b
#define TU16ACRH5                        BANKMASK(TU16ACRH), 5, b
#define TU16ACRH6                        BANKMASK(TU16ACRH), 6, b
#define TU16ACRH7                        BANKMASK(TU16ACRH), 7, b
#define TU16ACRL0                        BANKMASK(TU16ACRL), 0, b
#define TU16ACRL1                        BANKMASK(TU16ACRL), 1, b
#define TU16ACRL2                        BANKMASK(TU16ACRL), 2, b
#define TU16ACRL3                        BANKMASK(TU16ACRL), 3, b
#define TU16ACRL4                        BANKMASK(TU16ACRL), 4, b
#define TU16ACRL5                        BANKMASK(TU16ACRL), 5, b
#define TU16ACRL6                        BANKMASK(TU16ACRL), 6, b
#define TU16ACRL7                        BANKMASK(TU16ACRL), 7, b
#define TU16ACSYNC                       BANKMASK(TU16AHLT), 6, b
#define TU16AEPOL                        BANKMASK(TU16AHLT), 7, b
#define TU16AERS0                        BANKMASK(TU16AERS), 0, b
#define TU16AERS1                        BANKMASK(TU16AERS), 1, b
#define TU16AERS2                        BANKMASK(TU16AERS), 2, b
#define TU16AERS3                        BANKMASK(TU16AERS), 3, b
#define TU16AERS4                        BANKMASK(TU16AERS), 4, b
#define TU16AIE                          BANKMASK(PIE5), 2, a
#define TU16AIF                          BANKMASK(PIR5), 2, a
#define TU16AIP                          BANKMASK(IPR5), 2, a
#define TU16ALIMIT                       BANKMASK(TU16ACON1), 4, b
#define TU16AMD                          BANKMASK(PMD6), 0, b
#define TU16AOM                          BANKMASK(TU16ACON0), 5, b
#define TU16AON                          BANKMASK(TU16ACON0), 7, b
#define TU16AOPOL                        BANKMASK(TU16ACON0), 4, b
#define TU16APR0                         BANKMASK(TU16APRL), 0, b
#define TU16APR1                         BANKMASK(TU16APRL), 1, b
#define TU16APR10                        BANKMASK(TU16APRH), 2, b
#define TU16APR11                        BANKMASK(TU16APRH), 3, b
#define TU16APR12                        BANKMASK(TU16APRH), 4, b
#define TU16APR13                        BANKMASK(TU16APRH), 5, b
#define TU16APR14                        BANKMASK(TU16APRH), 6, b
#define TU16APR15                        BANKMASK(TU16APRH), 7, b
#define TU16APR2                         BANKMASK(TU16APRL), 2, b
#define TU16APR3                         BANKMASK(TU16APRL), 3, b
#define TU16APR4                         BANKMASK(TU16APRL), 4, b
