garyPenhook/PIC-Assembler/device_includes/pic18f55q71.inc
#define TU16APR5                         BANKMASK(TU16APRL), 5, b
#define TU16APR6                         BANKMASK(TU16APRL), 6, b
#define TU16APR7                         BANKMASK(TU16APRL), 7, b
#define TU16APR8                         BANKMASK(TU16APRH), 0, b
#define TU16APR9                         BANKMASK(TU16APRH), 1, b
#define TU16APRH0                        BANKMASK(TU16APRH), 0, b
#define TU16APRH1                        BANKMASK(TU16APRH), 1, b
#define TU16APRH2                        BANKMASK(TU16APRH), 2, b
#define TU16APRH3                        BANKMASK(TU16APRH), 3, b
#define TU16APRH4                        BANKMASK(TU16APRH), 4, b
#define TU16APRH5                        BANKMASK(TU16APRH), 5, b
#define TU16APRH6                        BANKMASK(TU16APRH), 6, b
#define TU16APRH7                        BANKMASK(TU16APRH), 7, b
#define TU16APRIE                        BANKMASK(TU16ACON0), 2, b
#define TU16APRIF                        BANKMASK(TU16ACON1), 2, b
#define TU16APRL0                        BANKMASK(TU16APRL), 0, b
#define TU16APRL1                        BANKMASK(TU16APRL), 1, b
#define TU16APRL2                        BANKMASK(TU16APRL), 2, b
#define TU16APRL3                        BANKMASK(TU16APRL), 3, b
#define TU16APRL4                        BANKMASK(TU16APRL), 4, b
#define TU16APRL5                        BANKMASK(TU16APRL), 5, b
#define TU16APRL6                        BANKMASK(TU16APRL), 6, b
#define TU16APRL7                        BANKMASK(TU16APRL), 7, b
#define TU16APS0                         BANKMASK(TU16APS), 0, b
#define TU16APS1                         BANKMASK(TU16APS), 1, b
#define TU16APS2                         BANKMASK(TU16APS), 2, b
#define TU16APS3                         BANKMASK(TU16APS), 3, b
#define TU16APS4                         BANKMASK(TU16APS), 4, b
#define TU16APS5                         BANKMASK(TU16APS), 5, b
#define TU16APS6                         BANKMASK(TU16APS), 6, b
#define TU16APS7                         BANKMASK(TU16APS), 7, b
#define TU16ARDSEL                       BANKMASK(TU16ACON0), 3, b
#define TU16ARESET0                      BANKMASK(TU16AHLT), 2, b
#define TU16ARESET1                      BANKMASK(TU16AHLT), 3, b
#define TU16ARUN                         BANKMASK(TU16ACON1), 7, b
#define TU16ASTART0                      BANKMASK(TU16AHLT), 4, b
#define TU16ASTART1                      BANKMASK(TU16AHLT), 5, b
#define TU16ASTOP0                       BANKMASK(TU16AHLT), 0, b
#define TU16ASTOP1                       BANKMASK(TU16AHLT), 1, b
#define TU16ATMR0                        BANKMASK(TU16ATMRL), 0, b
#define TU16ATMR1                        BANKMASK(TU16ATMRL), 1, b
#define TU16ATMR10                       BANKMASK(TU16ATMRH), 2, b
#define TU16ATMR11                       BANKMASK(TU16ATMRH), 3, b
#define TU16ATMR12                       BANKMASK(TU16ATMRH), 4, b
#define TU16ATMR13                       BANKMASK(TU16ATMRH), 5, b
#define TU16ATMR14                       BANKMASK(TU16ATMRH), 6, b
#define TU16ATMR15                       BANKMASK(TU16ATMRH), 7, b
#define TU16ATMR2                        BANKMASK(TU16ATMRL), 2, b
#define TU16ATMR3                        BANKMASK(TU16ATMRL), 3, b
#define TU16ATMR4                        BANKMASK(TU16ATMRL), 4, b
#define TU16ATMR5                        BANKMASK(TU16ATMRL), 5, b
#define TU16ATMR6                        BANKMASK(TU16ATMRL), 6, b
#define TU16ATMR7                        BANKMASK(TU16ATMRL), 7, b
#define TU16ATMR8                        BANKMASK(TU16ATMRH), 0, b
#define TU16ATMR9                        BANKMASK(TU16ATMRH), 1, b
#define TU16ATMRH0                       BANKMASK(TU16ATMRH), 0, b
#define TU16ATMRH1                       BANKMASK(TU16ATMRH), 1, b
#define TU16ATMRH2                       BANKMASK(TU16ATMRH), 2, b
#define TU16ATMRH3                       BANKMASK(TU16ATMRH), 3, b
#define TU16ATMRH4                       BANKMASK(TU16ATMRH), 4, b
#define TU16ATMRH5                       BANKMASK(TU16ATMRH), 5, b
#define TU16ATMRH6                       BANKMASK(TU16ATMRH), 6, b
#define TU16ATMRH7                       BANKMASK(TU16ATMRH), 7, b
#define TU16ATMRL0                       BANKMASK(TU16ATMRL), 0, b
#define TU16ATMRL1                       BANKMASK(TU16ATMRL), 1, b
#define TU16ATMRL2                       BANKMASK(TU16ATMRL), 2, b
#define TU16ATMRL3                       BANKMASK(TU16ATMRL), 3, b
#define TU16ATMRL4                       BANKMASK(TU16ATMRL), 4, b
#define TU16ATMRL5                       BANKMASK(TU16ATMRL), 5, b
#define TU16ATMRL6                       BANKMASK(TU16ATMRL), 6, b
#define TU16ATMRL7                       BANKMASK(TU16ATMRL), 7, b
#define TU16AZIE                         BANKMASK(TU16ACON0), 1, b
#define TU16AZIF                         BANKMASK(TU16ACON1), 1, b
#define TU16BCAPT                        BANKMASK(TU16BCON1), 3, b
#define TU16BCIE                         BANKMASK(TU16BCON0), 0, b
#define TU16BCIF                         BANKMASK(TU16BCON1), 0, b
#define TU16BCLK0                        BANKMASK(TU16BCLK), 0, b
#define TU16BCLK1                        BANKMASK(TU16BCLK), 1, b
#define TU16BCLK2                        BANKMASK(TU16BCLK), 2, b
#define TU16BCLK3                        BANKMASK(TU16BCLK), 3, b
#define TU16BCLK4                        BANKMASK(TU16BCLK), 4, b
#define TU16BCLR                         BANKMASK(TU16BCON1), 5, b
#define TU16BCPOL                        BANKMASK(TU16BCON0), 6, b
#define TU16BCR0                         BANKMASK(TU16BCRL), 0, b
#define TU16BCR1                         BANKMASK(TU16BCRL), 1, b
#define TU16BCR10                        BANKMASK(TU16BCRH), 2, b
#define TU16BCR11                        BANKMASK(TU16BCRH), 3, b
#define TU16BCR12                        BANKMASK(TU16BCRH), 4, b
#define TU16BCR13                        BANKMASK(TU16BCRH), 5, b
#define TU16BCR14                        BANKMASK(TU16BCRH), 6, b
#define TU16BCR15                        BANKMASK(TU16BCRH), 7, b
#define TU16BCR2                         BANKMASK(TU16BCRL), 2, b
#define TU16BCR3                         BANKMASK(TU16BCRL), 3, b
#define TU16BCR4                         BANKMASK(TU16BCRL), 4, b
#define TU16BCR5                         BANKMASK(TU16BCRL), 5, b
#define TU16BCR6                         BANKMASK(TU16BCRL), 6, b
#define TU16BCR7                         BANKMASK(TU16BCRL), 7, b
#define TU16BCR8                         BANKMASK(TU16BCRH), 0, b
#define TU16BCR9                         BANKMASK(TU16BCRH), 1, b
#define TU16BCRH0                        BANKMASK(TU16BCRH), 0, b
#define TU16BCRH1                        BANKMASK(TU16BCRH), 1, b
#define TU16BCRH2                        BANKMASK(TU16BCRH), 2, b
#define TU16BCRH3                        BANKMASK(TU16BCRH), 3, b
#define TU16BCRH4                        BANKMASK(TU16BCRH), 4, b
#define TU16BCRH5                        BANKMASK(TU16BCRH), 5, b
#define TU16BCRH6                        BANKMASK(TU16BCRH), 6, b
#define TU16BCRH7                        BANKMASK(TU16BCRH), 7, b
#define TU16BCRL0                        BANKMASK(TU16BCRL), 0, b
#define TU16BCRL1                        BANKMASK(TU16BCRL), 1, b
#define TU16BCRL2                        BANKMASK(TU16BCRL), 2, b
#define TU16BCRL3                        BANKMASK(TU16BCRL), 3, b
#define TU16BCRL4                        BANKMASK(TU16BCRL), 4, b
#define TU16BCRL5                        BANKMASK(TU16BCRL), 5, b
#define TU16BCRL6                        BANKMASK(TU16BCRL), 6, b
#define TU16BCRL7                        BANKMASK(TU16BCRL), 7, b
#define TU16BCSYNC                       BANKMASK(TU16BHLT), 6, b
#define TU16BEPOL                        BANKMASK(TU16BHLT), 7, b
#define TU16BERS0                        BANKMASK(TU16BERS), 0, b
#define TU16BERS1                        BANKMASK(TU16BERS), 1, b
#define TU16BERS2                        BANKMASK(TU16BERS), 2, b
#define TU16BERS3                        BANKMASK(TU16BERS), 3, b
#define TU16BERS4                        BANKMASK(TU16BERS), 4, b
#define TU16BIE                          BANKMASK(PIE10), 2, a
#define TU16BIF                          BANKMASK(PIR10), 2, a
#define TU16BIP                          BANKMASK(IPR10), 2, a
#define TU16BLIMIT                       BANKMASK(TU16BCON1), 4, b
#define TU16BMD                          BANKMASK(PMD6), 1, b
#define TU16BOM                          BANKMASK(TU16BCON0), 5, b
#define TU16BON                          BANKMASK(TU16BCON0), 7, b
#define TU16BOPOL                        BANKMASK(TU16BCON0), 4, b
#define TU16BPR0                         BANKMASK(TU16BPRL), 0, b
#define TU16BPR1                         BANKMASK(TU16BPRL), 1, b
#define TU16BPR10                        BANKMASK(TU16BPRH), 2, b
#define TU16BPR11                        BANKMASK(TU16BPRH), 3, b
#define TU16BPR12                        BANKMASK(TU16BPRH), 4, b
#define TU16BPR13                        BANKMASK(TU16BPRH), 5, b
#define TU16BPR14                        BANKMASK(TU16BPRH), 6, b
#define TU16BPR15                        BANKMASK(TU16BPRH), 7, b
#define TU16BPR2                         BANKMASK(TU16BPRL), 2, b
#define TU16BPR3                         BANKMASK(TU16BPRL), 3, b
#define TU16BPR4                         BANKMASK(TU16BPRL), 4, b
#define TU16BPR5                         BANKMASK(TU16BPRL), 5, b
#define TU16BPR6                         BANKMASK(TU16BPRL), 6, b
#define TU16BPR7                         BANKMASK(TU16BPRL), 7, b
#define TU16BPR8                         BANKMASK(TU16BPRH), 0, b
#define TU16BPR9                         BANKMASK(TU16BPRH), 1, b
#define TU16BPRH0                        BANKMASK(TU16BPRH), 0, b
#define TU16BPRH1                        BANKMASK(TU16BPRH), 1, b
#define TU16BPRH2                        BANKMASK(TU16BPRH), 2, b
#define TU16BPRH3                        BANKMASK(TU16BPRH), 3, b
#define TU16BPRH4                        BANKMASK(TU16BPRH), 4, b
#define TU16BPRH5                        BANKMASK(TU16BPRH), 5, b
#define TU16BPRH6                        BANKMASK(TU16BPRH), 6, b
#define TU16BPRH7                        BANKMASK(TU16BPRH), 7, b
#define TU16BPRIE                        BANKMASK(TU16BCON0), 2, b
#define TU16BPRIF                        BANKMASK(TU16BCON1), 2, b
#define TU16BPRL0                        BANKMASK(TU16BPRL), 0, b
#define TU16BPRL1                        BANKMASK(TU16BPRL), 1, b
#define TU16BPRL2                        BANKMASK(TU16BPRL), 2, b
#define TU16BPRL3                        BANKMASK(TU16BPRL), 3, b
#define TU16BPRL4                        BANKMASK(TU16BPRL), 4, b
#define TU16BPRL5                        BANKMASK(TU16BPRL), 5, b
#define TU16BPRL6                        BANKMASK(TU16BPRL), 6, b
#define TU16BPRL7                        BANKMASK(TU16BPRL), 7, b
#define TU16BPS0                         BANKMASK(TU16BPS), 0, b
#define TU16BPS1                         BANKMASK(TU16BPS), 1, b
#define TU16BPS2                         BANKMASK(TU16BPS), 2, b
#define TU16BPS3                         BANKMASK(TU16BPS), 3, b
#define TU16BPS4                         BANKMASK(TU16BPS), 4, b
#define TU16BPS5                         BANKMASK(TU16BPS), 5, b
#define TU16BPS6                         BANKMASK(TU16BPS), 6, b
#define TU16BPS7                         BANKMASK(TU16BPS), 7, b
#define TU16BRDSEL                       BANKMASK(TU16BCON0), 3, b
#define TU16BRESET0                      BANKMASK(TU16BHLT), 2, b
#define TU16BRESET1                      BANKMASK(TU16BHLT), 3, b
#define TU16BRUN                         BANKMASK(TU16BCON1), 7, b
#define TU16BSTART0                      BANKMASK(TU16BHLT), 4, b
#define TU16BSTART1                      BANKMASK(TU16BHLT), 5, b
#define TU16BSTOP0                       BANKMASK(TU16BHLT), 0, b
#define TU16BSTOP1                       BANKMASK(TU16BHLT), 1, b
#define TU16BTMR0                        BANKMASK(TU16BTMRL), 0, b
#define TU16BTMR1                        BANKMASK(TU16BTMRL), 1, b
#define TU16BTMR10                       BANKMASK(TU16BTMRH), 2, b
#define TU16BTMR11                       BANKMASK(TU16BTMRH), 3, b
#define TU16BTMR12                       BANKMASK(TU16BTMRH), 4, b
#define TU16BTMR13                       BANKMASK(TU16BTMRH), 5, b
#define TU16BTMR14                       BANKMASK(TU16BTMRH), 6, b
#define TU16BTMR15                       BANKMASK(TU16BTMRH), 7, b
#define TU16BTMR2                        BANKMASK(TU16BTMRL), 2, b
#define TU16BTMR3                        BANKMASK(TU16BTMRL), 3, b
#define TU16BTMR4                        BANKMASK(TU16BTMRL), 4, b
#define TU16BTMR5                        BANKMASK(TU16BTMRL), 5, b
#define TU16BTMR6                        BANKMASK(TU16BTMRL), 6, b
#define TU16BTMR7                        BANKMASK(TU16BTMRL), 7, b
#define TU16BTMR8                        BANKMASK(TU16BTMRH), 0, b
#define TU16BTMR9                        BANKMASK(TU16BTMRH), 1, b
#define TU16BTMRH0                       BANKMASK(TU16BTMRH), 0, b
#define TU16BTMRH1                       BANKMASK(TU16BTMRH), 1, b
#define TU16BTMRH2                       BANKMASK(TU16BTMRH), 2, b
#define TU16BTMRH3                       BANKMASK(TU16BTMRH), 3, b
#define TU16BTMRH4                       BANKMASK(TU16BTMRH), 4, b
#define TU16BTMRH5                       BANKMASK(TU16BTMRH), 5, b
#define TU16BTMRH6                       BANKMASK(TU16BTMRH), 6, b
#define TU16BTMRH7                       BANKMASK(TU16BTMRH), 7, b
#define TU16BTMRL0                       BANKMASK(TU16BTMRL), 0, b
#define TU16BTMRL1                       BANKMASK(TU16BTMRL), 1, b
#define TU16BTMRL2                       BANKMASK(TU16BTMRL), 2, b
#define TU16BTMRL3                       BANKMASK(TU16BTMRL), 3, b
#define TU16BTMRL4                       BANKMASK(TU16BTMRL), 4, b
#define TU16BTMRL5                       BANKMASK(TU16BTMRL), 5, b
#define TU16BTMRL6                       BANKMASK(TU16BTMRL), 6, b
#define TU16BTMRL7                       BANKMASK(TU16BTMRL), 7, b
#define TU16BZIE                         BANKMASK(TU16BCON0), 1, b
#define TU16BZIF                         BANKMASK(TU16BCON1), 1, b
#define TU1MD                            BANKMASK(PMD6), 0, b
#define TU2MD                            BANKMASK(PMD6), 1, b
#define TUIN0PPS0                        BANKMASK(TUIN0PPS), 0, b
#define TUIN0PPS1                        BANKMASK(TUIN0PPS), 1, b
#define TUIN0PPS2                        BANKMASK(TUIN0PPS), 2, b
#define TUIN0PPS3                        BANKMASK(TUIN0PPS), 3, b
#define TUIN0PPS4                        BANKMASK(TUIN0PPS), 4, b
#define TUIN0PPS5                        BANKMASK(TUIN0PPS), 5, b
#define TUIN1PPS0                        BANKMASK(TUIN1PPS), 0, b
#define TUIN1PPS1                        BANKMASK(TUIN1PPS), 1, b
#define TUIN1PPS2                        BANKMASK(TUIN1PPS), 2, b
#define TUIN1PPS3                        BANKMASK(TUIN1PPS), 3, b
#define TUIN1PPS4                        BANKMASK(TUIN1PPS), 4, b
#define TUIN1PPS5                        BANKMASK(TUIN1PPS), 5, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TWIDTH0                          BANKMASK(SPI1TWIDTH), 0, b
#define TWIDTH1                          BANKMASK(SPI1TWIDTH), 1, b
#define TWIDTH2                          BANKMASK(SPI1TWIDTH), 2, b
#define TXB0                             BANKMASK(SPI1TXB), 0, b
#define TXB1                             BANKMASK(SPI1TXB), 1, b
#define TXB2                             BANKMASK(SPI1TXB), 2, b
#define TXB3                             BANKMASK(SPI1TXB), 3, b
#define TXB4                             BANKMASK(SPI1TXB), 4, b
#define TXB5                             BANKMASK(SPI1TXB), 5, b
#define TXB6                             BANKMASK(SPI1TXB), 6, b
#define TXB7                             BANKMASK(SPI1TXB), 7, b
#define TXR                              BANKMASK(SPI1CON2), 1, b
#define TXU                              BANKMASK(I2C1CON1), 1, b
#define TXUIE                            BANKMASK(SPI1INTE), 1, b
#define TXUIF                            BANKMASK(SPI1INTF), 1, b
#define U1ABDEN                          BANKMASK(U1CON0), 6, b
#define U1ABDIE                          BANKMASK(U1UIR), 2, b
#define U1ABDIF                          BANKMASK(U1UIR), 6, b
#define U1ABDOVE                         BANKMASK(U1ERRIE), 5, b
#define U1ABDOVF                         BANKMASK(U1ERRIR), 5, b
#define U1BRGS                           BANKMASK(U1CON0), 7, b
#define U1BRKOVR                         BANKMASK(U1CON1), 1, b
#define U1C0EN                           BANKMASK(U1CON2), 3, b
#define U1CERIE                          BANKMASK(U1ERRIE), 4, b
#define U1CERIF                          BANKMASK(U1ERRIR), 4, b
#define U1CTSPPS0                        BANKMASK(U1CTSPPS), 0, b
#define U1CTSPPS1                        BANKMASK(U1CTSPPS), 1, b
#define U1CTSPPS2                        BANKMASK(U1CTSPPS), 2, b
#define U1CTSPPS3                        BANKMASK(U1CTSPPS), 3, b
#define U1CTSPPS4                        BANKMASK(U1CTSPPS), 4, b
#define U1CTSPPS5                        BANKMASK(U1CTSPPS), 5, b
#define U1EIE                            BANKMASK(PIE4), 2, a
#define U1EIF                            BANKMASK(PIR4), 2, a
#define U1EIP                            BANKMASK(IPR4), 2, a
#define U1FERIE                          BANKMASK(U1ERRIE), 3, b
#define U1FERIF                          BANKMASK(U1ERRIR), 3, b
#define U1FLO0                           BANKMASK(U1CON2), 0, b
#define U1FLO1                           BANKMASK(U1CON2), 1, b
#define U1IE                             BANKMASK(PIE4), 3, a
#define U1IF                             BANKMASK(PIR4), 3, a
#define U1IP                             BANKMASK(IPR4), 3, a
#define U1MD                             BANKMASK(PMD3), 6, b
#define U1MODE0                          BANKMASK(U1CON0), 0, b
#define U1MODE1                          BANKMASK(U1CON0), 1, b
#define U1MODE2                          BANKMASK(U1CON0), 2, b
#define U1MODE3                          BANKMASK(U1CON0), 3, b
#define U1ON                             BANKMASK(U1CON1), 7, b
#define U1PERIE                          BANKMASK(U1ERRIE), 6, b
#define U1PERIF                          BANKMASK(U1ERRIR), 6, b
#define U1RCIDL                          BANKMASK(U1FIFO), 3, b
#define U1RUNOVF                         BANKMASK(U1CON2), 7, b
#define U1RXBE                           BANKMASK(U1FIFO), 1, b
#define U1RXBF                           BANKMASK(U1FIFO), 0, b
#define U1RXBIMD                         BANKMASK(U1CON1), 3, b
#define U1RXBKIE                         BANKMASK(U1ERRIE), 2, b
#define U1RXBKIF                         BANKMASK(U1ERRIR), 2, b
#define U1RXEN                           BANKMASK(U1CON0), 4, b
#define U1RXFOIE                         BANKMASK(U1ERRIE), 1, b
#define U1RXFOIF                         BANKMASK(U1ERRIR), 1, b
#define U1RXIDL                          BANKMASK(U1FIFO), 3, b
#define U1RXIE                           BANKMASK(PIE4), 0, a
#define U1RXIF                           BANKMASK(PIR4), 0, a
#define U1RXIP                           BANKMASK(IPR4), 0, a
#define U1RXPOL                          BANKMASK(U1CON2), 6, b
#define U1RXPPS0                         BANKMASK(U1RXPPS), 0, b
#define U1RXPPS1                         BANKMASK(U1RXPPS), 1, b
#define U1RXPPS2                         BANKMASK(U1RXPPS), 2, b
#define U1RXPPS3                         BANKMASK(U1RXPPS), 3, b
#define U1RXPPS4                         BANKMASK(U1RXPPS), 4, b
#define U1RXPPS5                         BANKMASK(U1RXPPS), 5, b
#define U1SENDB                          BANKMASK(U1CON1), 0, b
#define U1STP0                           BANKMASK(U1CON2), 4, b
#define U1STP1                           BANKMASK(U1CON2), 5, b
#define U1STPMD                          BANKMASK(U1FIFO), 6, b
#define U1TXBE                           BANKMASK(U1FIFO), 5, b
#define U1TXBF                           BANKMASK(U1FIFO), 4, b
#define U1TXCIE                          BANKMASK(U1ERRIE), 0, b
#define U1TXCIF                          BANKMASK(U1ERRIR), 0, b
#define U1TXEN                           BANKMASK(U1CON0), 5, b
#define U1TXIE                           BANKMASK(PIE4), 1, a
#define U1TXIF                           BANKMASK(PIR4), 1, a
#define U1TXIP                           BANKMASK(IPR4), 1, a
#define U1TXMTIE                         BANKMASK(U1ERRIE), 7, b
#define U1TXMTIF                         BANKMASK(U1ERRIR), 7, b
#define U1TXPOL                          BANKMASK(U1CON2), 2, b
#define U1TXWRE                          BANKMASK(U1FIFO), 7, b
#define U1WUE                            BANKMASK(U1CON1), 4, b
#define U1WUIF                           BANKMASK(U1UIR), 7, b
#define U1XON                            BANKMASK(U1FIFO), 2, b
#define U2ABDEN                          BANKMASK(U2CON0), 6, b
#define U2ABDIE                          BANKMASK(U2UIR), 2, b
#define U2ABDIF                          BANKMASK(U2UIR), 6, b
#define U2ABDOVE                         BANKMASK(U2ERRIE), 5, b
#define U2ABDOVF                         BANKMASK(U2ERRIR), 5, b
#define U2BRGS                           BANKMASK(U2CON0), 7, b
#define U2BRKOVR                         BANKMASK(U2CON1), 1, b
#define U2CERIE                          BANKMASK(U2ERRIE), 4, b
#define U2CERIF                          BANKMASK(U2ERRIR), 4, b
#define U2CTSPPS0                        BANKMASK(U2CTSPPS), 0, b
#define U2CTSPPS1                        BANKMASK(U2CTSPPS), 1, b
#define U2CTSPPS2                        BANKMASK(U2CTSPPS), 2, b
#define U2CTSPPS3                        BANKMASK(U2CTSPPS), 3, b
#define U2CTSPPS4                        BANKMASK(U2CTSPPS), 4, b
#define U2CTSPPS5                        BANKMASK(U2CTSPPS), 5, b
#define U2EIE                            BANKMASK(PIE8), 2, a
#define U2EIF                            BANKMASK(PIR8), 2, a
#define U2EIP                            BANKMASK(IPR8), 2, a
#define U2FERIE                          BANKMASK(U2ERRIE), 3, b
#define U2FERIF                          BANKMASK(U2ERRIR), 3, b
#define U2FLO0                           BANKMASK(U2CON2), 0, b
#define U2FLO1                           BANKMASK(U2CON2), 1, b
#define U2IE                             BANKMASK(PIE8), 3, a
#define U2IF                             BANKMASK(PIR8), 3, a
#define U2IP                             BANKMASK(IPR8), 3, a
#define U2MD                             BANKMASK(PMD3), 7, b
#define U2MODE0                          BANKMASK(U2CON0), 0, b
#define U2MODE1                          BANKMASK(U2CON0), 1, b
#define U2MODE2                          BANKMASK(U2CON0), 2, b
#define U2MODE3                          BANKMASK(U2CON0), 3, b
#define U2ON                             BANKMASK(U2CON1), 7, b
#define U2PERIE                          BANKMASK(U2ERRIE), 6, b
#define U2PERIF                          BANKMASK(U2ERRIR), 6, b
#define U2RCIDL                          BANKMASK(U2FIFO), 3, b
#define U2RUNOVF                         BANKMASK(U2CON2), 7, b
#define U2RXBE                           BANKMASK(U2FIFO), 1, b
#define U2RXBF                           BANKMASK(U2FIFO), 0, b
#define U2RXBIMD                         BANKMASK(U2CON1), 3, b
#define U2RXBKIE                         BANKMASK(U2ERRIE), 2, b
#define U2RXBKIF                         BANKMASK(U2ERRIR), 2, b
#define U2RXEN                           BANKMASK(U2CON0), 4, b
#define U2RXFOIE                         BANKMASK(U2ERRIE), 1, b
#define U2RXFOIF                         BANKMASK(U2ERRIR), 1, b
